[NoCoverage] BlockStatement
signalstory/testing/src/helper.ts:97:9
 export function configureInjectionContext(
   store: Store<any>,
   configure: (options: InjectionContextConfiguration) => void
-): void {
-  const options = new DefaultInjectionContextConfiguration();
-  configure(options);
-  (store.config.injector as any) = Injector.create({
-    providers: options.collectProviders(),
-  });
-}
+): void {}
 
 /**

[NoCoverage] BlockStatement
signalstory/testing/src/helper.ts:115:18
 export function getFromStoreInjector<T>(
   store: Store<any>,
   classType: ProviderToken<T>
-): T | undefined {
-  return store.config.injector?.get(classType);
-}
+): T | undefined {}
 
 /**

[NoCoverage] OptionalChaining
signalstory/testing/src/helper.ts:116:10
   store: Store<any>,
   classType: ProviderToken<T>
 ): T | undefined {
-  return store.config.injector?.get(classType);
+  return store.config.injector.get(classType);
 }
 

[NoCoverage] ArrayDeclaration
signalstory/testing/src/helper.ts:127:41
 export class DefaultInjectionContextConfiguration
   implements InjectionContextConfiguration
 {
-  private providers: StaticProvider[] = [];
+  private providers: StaticProvider[] = ["Stryker was here"];
 
   collectProviders(): StaticProvider[] {

[NoCoverage] BlockStatement
signalstory/testing/src/helper.ts:129:40
 {
   private providers: StaticProvider[] = [];
 
-  collectProviders(): StaticProvider[] {
-    return this.providers;
-  }
+  collectProviders(): StaticProvider[] {}
 
   add(provider: StaticProvider): InjectionContextConfiguration {

[NoCoverage] BlockStatement
signalstory/testing/src/helper.ts:133:64
     return this.providers;
   }
 
-  add(provider: StaticProvider): InjectionContextConfiguration {
-    this.providers.push(provider);
-    return this;
-  }
+  add(provider: StaticProvider): InjectionContextConfiguration {}
 
   addRegular<T>(classType: ProviderToken<T>): InjectionContextConfiguration {

[NoCoverage] BlockStatement
signalstory/testing/src/helper.ts:138:77
     return this;
   }
 
-  addRegular<T>(classType: ProviderToken<T>): InjectionContextConfiguration {
-    this.providers.push(<StaticProvider>{ provide: classType });
-    return this;
-  }
+  addRegular<T>(classType: ProviderToken<T>): InjectionContextConfiguration {}
 
   addExisting<T>(

[NoCoverage] BlockStatement
signalstory/testing/src/helper.ts:146:36
   addExisting<T>(
     classType: ProviderToken<T>,
     instance: T
-  ): InjectionContextConfiguration {
-    this.providers.push({
-      provide: classType,
-      useFactory: () => instance,
-    });
-    return this;
-  }
+  ): InjectionContextConfiguration {}
 
   addMocked<T>(

[NoCoverage] ArrowFunction
signalstory/testing/src/helper.ts:149:19
   ): InjectionContextConfiguration {
     this.providers.push({
       provide: classType,
-      useFactory: () => instance,
+      useFactory: () => undefined,
     });
     return this;

[NoCoverage] BlockStatement
signalstory/testing/src/helper.ts:157:36
   addMocked<T>(
     classType: ProviderToken<T>,
     configureInstance: (obj: T) => void
-  ): InjectionContextConfiguration {
-    this.providers.push({
-      provide: classType,
-      useFactory: () => {
-        const instance = Object.create(classType);
-        configureInstance(instance);
-        return instance;
-      },
-    });
-    return this;
-  }
+  ): InjectionContextConfiguration {}
 }
 

[NoCoverage] ObjectLiteral
signalstory/testing/src/helper.ts:158:25
     classType: ProviderToken<T>,
     configureInstance: (obj: T) => void
   ): InjectionContextConfiguration {
-    this.providers.push({
-      provide: classType,
-      useFactory: () => {
-        const instance = Object.create(classType);
-        configureInstance(instance);
-        return instance;
-      },
-    });
+    this.providers.push({});
     return this;
   }

[NoCoverage] BlockStatement
signalstory/testing/src/helper.ts:160:25
   ): InjectionContextConfiguration {
     this.providers.push({
       provide: classType,
-      useFactory: () => {
-        const instance = Object.create(classType);
-        configureInstance(instance);
-        return instance;
-      },
+      useFactory: () => {},
     });
     return this;
