[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:18:52
 /**
  * Creates an empty Mediator registry.
  */
-export function createRegistry(): MediatorRegistry {
-  return new WeakMap<
-    StoreEvent<unknown>,
-    Set<EventHandler<Store<unknown>, unknown>>
-  >();
-}
+export function createRegistry(): MediatorRegistry {}
 
 /**
killedBy: registerHandler should register Handler in rootRegistry
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:44:3
   store: TStore,
   event: StoreEvent<TPayload>,
   handler: (store: TStore, event: StoreEvent<TPayload>) => void
-) {
-  const existingHandlers =
-    registry.get(event) || new Set<EventHandler<Store<unknown>, unknown>>();
-  existingHandlers.add({
-    store: new WeakRef(store),
-    handler,
-  } as unknown as EventHandler<Store<unknown>, unknown>);
-  registry.set(event, existingHandlers);
-}
+) {}
 
 /**
killedBy: registerHandler should register Handler in rootRegistry
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
signalstory/src/lib/store-mediator.ts:46:5
   handler: (store: TStore, event: StoreEvent<TPayload>) => void
 ) {
   const existingHandlers =
-    registry.get(event) || new Set<EventHandler<Store<unknown>, unknown>>();
+    false;
   existingHandlers.add({
     store: new WeakRef(store),
killedBy: registerHandler should register Handler in rootRegistry
statusReason: TypeError: existingHandlers.add is not a function

[Killed] LogicalOperator
signalstory/src/lib/store-mediator.ts:46:5
   handler: (store: TStore, event: StoreEvent<TPayload>) => void
 ) {
   const existingHandlers =
-    registry.get(event) || new Set<EventHandler<Store<unknown>, unknown>>();
+    registry.get(event) && new Set<EventHandler<Store<unknown>, unknown>>();
   existingHandlers.add({
     store: new WeakRef(store),
killedBy: registerHandler should register Handler in rootRegistry
statusReason: TypeError: Cannot read properties of undefined (reading 'add')

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:65:3
   registry: MediatorRegistry,
   store: TStore,
   ...events: StoreEvent<unknown>[]
-) {
-  for (const event of events) {
-    const handlers = registry.get(event);
-    if (handlers) {
-      handlers.forEach(handler => {
-        const handlingStore = handler.store.deref();
-        if (!handlingStore || handlingStore === store) {
-          handlers.delete(handler);
-        }
-      });
-      if (handlers.size === 0) {
-        registry.delete(event);
-      }
-    }
-  }
-}
+) {}
 
 /**
killedBy: unregisterHandler should unregister existing Handler in rootRegistry
statusReason: Error: expect(received).toBeUndefined()

Received: Set {{"handler": [Function anonymous], "store": {}}}

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:66:31
   store: TStore,
   ...events: StoreEvent<unknown>[]
 ) {
-  for (const event of events) {
-    const handlers = registry.get(event);
-    if (handlers) {
-      handlers.forEach(handler => {
-        const handlingStore = handler.store.deref();
-        if (!handlingStore || handlingStore === store) {
-          handlers.delete(handler);
-        }
-      });
-      if (handlers.size === 0) {
-        registry.delete(event);
-      }
-    }
-  }
+  for (const event of events) {}
 }
 
killedBy: unregisterHandler should unregister existing Handler in rootRegistry
statusReason: Error: expect(received).toBeUndefined()

Received: Set {{"handler": [Function anonymous], "store": {}}}

[Killed] ConditionalExpression
signalstory/src/lib/store-mediator.ts:68:9
 ) {
   for (const event of events) {
     const handlers = registry.get(event);
-    if (handlers) {
+    if (true) {
       handlers.forEach(handler => {
         const handlingStore = handler.store.deref();
killedBy: unregisterHandler should not throw if no Handler exists in rootRegistry
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'forEach')"

      118 |           } else {
      119 |             stryCov_9fa48("61");
    > 120 |             handlers.forEach(handler => {

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:68:19
 ) {
   for (const event of events) {
     const handlers = registry.get(event);
-    if (handlers) {
-      handlers.forEach(handler => {
-        const handlingStore = handler.store.deref();
-        if (!handlingStore || handlingStore === store) {
-          handlers.delete(handler);
-        }
-      });
-      if (handlers.size === 0) {
-        registry.delete(event);
-      }
-    }
+    if (handlers) {}
   }
 }
killedBy: unregisterHandler should unregister existing Handler in rootRegistry
statusReason: Error: expect(received).toBeUndefined()

Received: Set {{"handler": [Function anonymous], "store": {}}}

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:69:35
   for (const event of events) {
     const handlers = registry.get(event);
     if (handlers) {
-      handlers.forEach(handler => {
-        const handlingStore = handler.store.deref();
-        if (!handlingStore || handlingStore === store) {
-          handlers.delete(handler);
-        }
-      });
+      handlers.forEach(handler => {});
       if (handlers.size === 0) {
         registry.delete(event);
killedBy: unregisterHandler should unregister existing Handler in rootRegistry
statusReason: Error: expect(received).toBeUndefined()

Received: Set {{"handler": [Function anonymous], "store": {}}}

[Killed] ConditionalExpression
signalstory/src/lib/store-mediator.ts:71:13
     if (handlers) {
       handlers.forEach(handler => {
         const handlingStore = handler.store.deref();
-        if (!handlingStore || handlingStore === store) {
+        if (true) {
           handlers.delete(handler);
         }
killedBy: unregister should remove the associated event handlers for a single store and not chaning anything for other stores
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BooleanLiteral
signalstory/src/lib/store-mediator.ts:71:13
     if (handlers) {
       handlers.forEach(handler => {
         const handlingStore = handler.store.deref();
-        if (!handlingStore || handlingStore === store) {
+        if (handlingStore || handlingStore === store) {
           handlers.delete(handler);
         }
killedBy: unregister should remove the associated event handlers for a single store and not chaning anything for other stores
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] EqualityOperator
signalstory/src/lib/store-mediator.ts:75:11
           handlers.delete(handler);
         }
       });
-      if (handlers.size === 0) {
+      if (handlers.size !== 0) {
         registry.delete(event);
       }
killedBy: unregisterHandler should unregister existing Handler in rootRegistry
statusReason: Error: expect(received).toBeUndefined()

Received: Set {}

[Killed] ConditionalExpression
signalstory/src/lib/store-mediator.ts:75:11
           handlers.delete(handler);
         }
       });
-      if (handlers.size === 0) {
+      if (true) {
         registry.delete(event);
       }
killedBy: unregister should remove the associated event handlers for a single store and not chaning anything for other stores
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:113:17
     payload: payload,
   };
 
-  if (handlers) {
-    const errors: Error[] = [];
-    for (const handler of handlers) {
-      const store = handler.store.deref();
-      if (store) {
-        try {
-          handler.handler(store, eventWithPayload);
-        } catch (error) {
-          errors.push(error as Error);
-        }
-      } else {
-        handlers.delete(handler);
-      }
-    }
-    if (errors.length > 0) {
-      throw new AggregateError(
-        errors,
-        `Errors in Handler for event ${eventWithPayload.name}`
-      );
-    }
-  }
+  if (handlers) {}
 }
 
killedBy: publish should execute the associated event handlers for a single event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
signalstory/src/lib/store-mediator.ts:113:7
     payload: payload,
   };
 
-  if (handlers) {
+  if (false) {
     const errors: Error[] = [];
     for (const handler of handlers) {
killedBy: publish should execute the associated event handlers for a single event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrayDeclaration
signalstory/src/lib/store-mediator.ts:114:29
   };
 
   if (handlers) {
-    const errors: Error[] = [];
+    const errors: Error[] = ["Stryker was here"];
     for (const handler of handlers) {
       const store = handler.store.deref();
killedBy: publish should execute the associated event handlers for a single event
statusReason: AggregateError: Errors in Handler for event event

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:115:37
 
   if (handlers) {
     const errors: Error[] = [];
-    for (const handler of handlers) {
-      const store = handler.store.deref();
-      if (store) {
-        try {
-          handler.handler(store, eventWithPayload);
-        } catch (error) {
-          errors.push(error as Error);
-        }
-      } else {
-        handlers.delete(handler);
-      }
-    }
+    for (const handler of handlers) {}
     if (errors.length > 0) {
       throw new AggregateError(
killedBy: publish should execute the associated event handlers for a single event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
signalstory/src/lib/store-mediator.ts:117:11
     const errors: Error[] = [];
     for (const handler of handlers) {
       const store = handler.store.deref();
-      if (store) {
+      if (false) {
         try {
           handler.handler(store, eventWithPayload);
killedBy: publish should execute the associated event handlers for a single event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:117:18
     const errors: Error[] = [];
     for (const handler of handlers) {
       const store = handler.store.deref();
-      if (store) {
-        try {
-          handler.handler(store, eventWithPayload);
-        } catch (error) {
-          errors.push(error as Error);
-        }
-      } else {
+      if (store) {} else {
         handlers.delete(handler);
       }
killedBy: publish should execute the associated event handlers for a single event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:118:13
     for (const handler of handlers) {
       const store = handler.store.deref();
       if (store) {
-        try {
-          handler.handler(store, eventWithPayload);
-        } catch (error) {
+        try {} catch (error) {
           errors.push(error as Error);
         }
killedBy: publish should execute the associated event handlers for a single event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[NoCoverage] BlockStatement
signalstory/src/lib/store-mediator.ts:120:25
       if (store) {
         try {
           handler.handler(store, eventWithPayload);
-        } catch (error) {
-          errors.push(error as Error);
-        }
+        } catch (error) {}
       } else {
         handlers.delete(handler);

[NoCoverage] BlockStatement
signalstory/src/lib/store-mediator.ts:123:14
         } catch (error) {
           errors.push(error as Error);
         }
-      } else {
-        handlers.delete(handler);
-      }
+      } else {}
     }
     if (errors.length > 0) {

[Killed] EqualityOperator
signalstory/src/lib/store-mediator.ts:127:9
         handlers.delete(handler);
       }
     }
-    if (errors.length > 0) {
+    if (errors.length >= 0) {
       throw new AggregateError(
         errors,
killedBy: publish should execute the associated event handlers for a single event
statusReason: AggregateError: Errors in Handler for event event

[Killed] ConditionalExpression
signalstory/src/lib/store-mediator.ts:127:9
         handlers.delete(handler);
       }
     }
-    if (errors.length > 0) {
+    if (true) {
       throw new AggregateError(
         errors,
killedBy: publish should execute the associated event handlers for a single event
statusReason: AggregateError: Errors in Handler for event event

[Killed] BlockStatement
signalstory/src/lib/store-mediator.ts:149:79
   payload?: undefined
 ): void;
 export function publishStoreEvent<T>(event: StoreEvent<T>, payload: T): void;
-export function publishStoreEvent<T>(event: StoreEvent<T>, payload?: T): void {
-  publish(rootRegistry, event, payload);
-}
+export function publishStoreEvent<T>(event: StoreEvent<T>, payload?: T): void {}
 
killedBy: publishStoreEvent should execute the associated event handlers for a single event
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
