[Killed] BlockStatement
src/lib/store-plugin-deep-freeze/deep-freeze.ts:8:12
  * @returns {T} The deeply frozen object.
  */
 export function deepFreeze<T>(obj: T): T {
-  if (obj) {
-    Object.freeze(obj);
-
-    const oIsFunction = typeof obj === 'function';
-    const hasOwnProp = Object.prototype.hasOwnProperty;
-
-    Object.getOwnPropertyNames(obj).forEach(function (prop: string) {
-      if (
-        hasOwnProp.call(obj, prop) &&
-        (oIsFunction
-          ? prop !== 'caller' && prop !== 'callee' && prop !== 'arguments'
-          : true)
-      ) {
-        const propValue = obj[prop as keyof T];
-        if (
-          propValue !== null &&
-          (typeof propValue === 'object' || typeof propValue === 'function') &&
-          !Object.isFrozen(propValue)
-        ) {
-          deepFreeze(propValue);
-        }
-      }
-    });
-  }
+  if (obj) {}
 
   return obj;
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/lib/store-plugin-deep-freeze/deep-freeze.ts:8:7
  * @returns {T} The deeply frozen object.
  */
 export function deepFreeze<T>(obj: T): T {
-  if (obj) {
+  if (false) {
     Object.freeze(obj);
 
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] ConditionalExpression
src/lib/store-plugin-deep-freeze/deep-freeze.ts:11:25
   if (obj) {
     Object.freeze(obj);
 
-    const oIsFunction = typeof obj === 'function';
+    const oIsFunction = true;
     const hasOwnProp = Object.prototype.hasOwnProperty;
 

[Survived] EqualityOperator
src/lib/store-plugin-deep-freeze/deep-freeze.ts:11:25
   if (obj) {
     Object.freeze(obj);
 
-    const oIsFunction = typeof obj === 'function';
+    const oIsFunction = typeof obj !== 'function';
     const hasOwnProp = Object.prototype.hasOwnProperty;
 

[Killed] BlockStatement
src/lib/store-plugin-deep-freeze/deep-freeze.ts:14:69
     const oIsFunction = typeof obj === 'function';
     const hasOwnProp = Object.prototype.hasOwnProperty;
 
-    Object.getOwnPropertyNames(obj).forEach(function (prop: string) {
-      if (
-        hasOwnProp.call(obj, prop) &&
-        (oIsFunction
-          ? prop !== 'caller' && prop !== 'callee' && prop !== 'arguments'
-          : true)
-      ) {
-        const propValue = obj[prop as keyof T];
-        if (
-          propValue !== null &&
-          (typeof propValue === 'object' || typeof propValue === 'function') &&
-          !Object.isFrozen(propValue)
-        ) {
-          deepFreeze(propValue);
-        }
-      }
-    });
+    Object.getOwnPropertyNames(obj).forEach(function (prop: string) {});
   }
 
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/lib/store-plugin-deep-freeze/deep-freeze.ts:16:9
 
     Object.getOwnPropertyNames(obj).forEach(function (prop: string) {
       if (
-        hasOwnProp.call(obj, prop) &&
-        (oIsFunction
-          ? prop !== 'caller' && prop !== 'callee' && prop !== 'arguments'
-          : true)
+        false
       ) {
         const propValue = obj[prop as keyof T];
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] LogicalOperator
src/lib/store-plugin-deep-freeze/deep-freeze.ts:16:9
 
     Object.getOwnPropertyNames(obj).forEach(function (prop: string) {
       if (
-        hasOwnProp.call(obj, prop) &&
-        (oIsFunction
-          ? prop !== 'caller' && prop !== 'callee' && prop !== 'arguments'
-          : true)
+        hasOwnProp.call(obj, prop) || (oIsFunction ? prop !== 'caller' && prop !== 'callee' && prop !== 'arguments' : true)
       ) {
         const propValue = obj[prop as keyof T];

[NoCoverage] LogicalOperator
src/lib/store-plugin-deep-freeze/deep-freeze.ts:18:13
       if (
         hasOwnProp.call(obj, prop) &&
         (oIsFunction
-          ? prop !== 'caller' && prop !== 'callee' && prop !== 'arguments'
+          ? prop !== 'caller' && prop !== 'callee' || prop !== 'arguments'
           : true)
       ) {

[NoCoverage] ConditionalExpression
src/lib/store-plugin-deep-freeze/deep-freeze.ts:18:13
       if (
         hasOwnProp.call(obj, prop) &&
         (oIsFunction
-          ? prop !== 'caller' && prop !== 'callee' && prop !== 'arguments'
+          ? false
           : true)
       ) {

[Killed] BooleanLiteral
src/lib/store-plugin-deep-freeze/deep-freeze.ts:19:13
         hasOwnProp.call(obj, prop) &&
         (oIsFunction
           ? prop !== 'caller' && prop !== 'callee' && prop !== 'arguments'
-          : true)
+          : false)
       ) {
         const propValue = obj[prop as keyof T];
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/lib/store-plugin-deep-freeze/deep-freeze.ts:20:9
         (oIsFunction
           ? prop !== 'caller' && prop !== 'callee' && prop !== 'arguments'
           : true)
-      ) {
-        const propValue = obj[prop as keyof T];
-        if (
-          propValue !== null &&
-          (typeof propValue === 'object' || typeof propValue === 'function') &&
-          !Object.isFrozen(propValue)
-        ) {
-          deepFreeze(propValue);
-        }
-      }
+      ) {}
     });
   }
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
src/lib/store-plugin-deep-freeze/deep-freeze.ts:23:11
       ) {
         const propValue = obj[prop as keyof T];
         if (
-          propValue !== null &&
+          propValue === null &&
           (typeof propValue === 'object' || typeof propValue === 'function') &&
           !Object.isFrozen(propValue)
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/lib/store-plugin-deep-freeze/deep-freeze.ts:23:11
       ) {
         const propValue = obj[prop as keyof T];
         if (
-          propValue !== null &&
-          (typeof propValue === 'object' || typeof propValue === 'function') &&
-          !Object.isFrozen(propValue)
+          false
         ) {
           deepFreeze(propValue);
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] LogicalOperator
src/lib/store-plugin-deep-freeze/deep-freeze.ts:24:12
         const propValue = obj[prop as keyof T];
         if (
           propValue !== null &&
-          (typeof propValue === 'object' || typeof propValue === 'function') &&
+          (typeof propValue === 'object' && typeof propValue === 'function') &&
           !Object.isFrozen(propValue)
         ) {
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/lib/store-plugin-deep-freeze/deep-freeze.ts:24:12
         const propValue = obj[prop as keyof T];
         if (
           propValue !== null &&
-          (typeof propValue === 'object' || typeof propValue === 'function') &&
+          (false || typeof propValue === 'function') &&
           !Object.isFrozen(propValue)
         ) {
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/lib/store-plugin-deep-freeze/deep-freeze.ts:25:11
         if (
           propValue !== null &&
           (typeof propValue === 'object' || typeof propValue === 'function') &&
-          !Object.isFrozen(propValue)
+          Object.isFrozen(propValue)
         ) {
           deepFreeze(propValue);
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/lib/store-plugin-deep-freeze/deep-freeze.ts:26:11
           propValue !== null &&
           (typeof propValue === 'object' || typeof propValue === 'function') &&
           !Object.isFrozen(propValue)
-        ) {
-          deepFreeze(propValue);
-        }
+        ) {}
       }
     });
killedBy: deepFreeze should freeze all properties
statusReason: Error: expect(received).toBeTruthy()

Received: false
