[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:61:61
  * @param name Name of the store.
  * @returns The store, if found.
  */
-function getStore(name: string): Store<unknown> | undefined {
-  return registry.get(name)?.deref();
-}
+function getStore(name: string): Store<unknown> | undefined {}
 
 /**

[NoCoverage] OptionalChaining
src/lib/store-plugin-devtools/plugin-devtools.ts:62:10
  * @returns The store, if found.
  */
 function getStore(name: string): Store<unknown> | undefined {
-  return registry.get(name)?.deref();
+  return registry.get(name).deref();
 }
 

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:74:60
  * Initializes the Redux DevTools extension.
  * @param options DevTools options.
  */
-function initDevtools(options: DevtoolsOptions = {}): void {
-  if (window && '__REDUX_DEVTOOLS_EXTENSION__' in window) {
-    devtools = window.__REDUX_DEVTOOLS_EXTENSION__.connect(options);
-    devtools.subscribe(handleDevtoolsMessage);
-  } else {
-    console.warn(
-      'ATTENTION: Attempted to initialize redux devtools, but no browser extension was found!'
-    );
-  }
-}
+function initDevtools(options: DevtoolsOptions = {}): void {}
 
 /**

[NoCoverage] ConditionalExpression
src/lib/store-plugin-devtools/plugin-devtools.ts:75:7
  * @param options DevTools options.
  */
 function initDevtools(options: DevtoolsOptions = {}): void {
-  if (window && '__REDUX_DEVTOOLS_EXTENSION__' in window) {
+  if (false) {
     devtools = window.__REDUX_DEVTOOLS_EXTENSION__.connect(options);
     devtools.subscribe(handleDevtoolsMessage);

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:75:59
  * @param options DevTools options.
  */
 function initDevtools(options: DevtoolsOptions = {}): void {
-  if (window && '__REDUX_DEVTOOLS_EXTENSION__' in window) {
-    devtools = window.__REDUX_DEVTOOLS_EXTENSION__.connect(options);
-    devtools.subscribe(handleDevtoolsMessage);
-  } else {
+  if (window && '__REDUX_DEVTOOLS_EXTENSION__' in window) {} else {
     console.warn(
       'ATTENTION: Attempted to initialize redux devtools, but no browser extension was found!'

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:78:10
   if (window && '__REDUX_DEVTOOLS_EXTENSION__' in window) {
     devtools = window.__REDUX_DEVTOOLS_EXTENSION__.connect(options);
     devtools.subscribe(handleDevtoolsMessage);
-  } else {
-    console.warn(
-      'ATTENTION: Attempted to initialize redux devtools, but no browser extension was found!'
-    );
-  }
+  } else {}
 }
 

[NoCoverage] StringLiteral
src/lib/store-plugin-devtools/plugin-devtools.ts:80:7
     devtools.subscribe(handleDevtoolsMessage);
   } else {
     console.warn(
-      'ATTENTION: Attempted to initialize redux devtools, but no browser extension was found!'
+      ""
     );
   }

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:90:79
  * @returns Snapshot of registered stores.
  * @modifies registry - Deletes references to garbage collected stores
  */
-function scavengeAndGetStoresSnapshot<T extends Record<string, unknown>>(): T {
-  const stores: T = {} as T;
-
-  registry.forEach((storeRef, name) => {
-    const store = storeRef.deref();
-    if (store) {
-      stores[store.name as keyof T] = store.state() as T[keyof T];
-    } else {
-      registry.delete(name);
-      sendToDevtools({ type: `[${name}] - @Removal` });
-    }
-  });
-
-  return stores;
-}
+function scavengeAndGetStoresSnapshot<T extends Record<string, unknown>>(): T {}
 
 /**

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:93:40
 function scavengeAndGetStoresSnapshot<T extends Record<string, unknown>>(): T {
   const stores: T = {} as T;
 
-  registry.forEach((storeRef, name) => {
-    const store = storeRef.deref();
-    if (store) {
-      stores[store.name as keyof T] = store.state() as T[keyof T];
-    } else {
-      registry.delete(name);
-      sendToDevtools({ type: `[${name}] - @Removal` });
-    }
-  });
+  registry.forEach((storeRef, name) => {});
 
   return stores;

[NoCoverage] ConditionalExpression
src/lib/store-plugin-devtools/plugin-devtools.ts:95:9
 
   registry.forEach((storeRef, name) => {
     const store = storeRef.deref();
-    if (store) {
+    if (true) {
       stores[store.name as keyof T] = store.state() as T[keyof T];
     } else {

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:95:16
 
   registry.forEach((storeRef, name) => {
     const store = storeRef.deref();
-    if (store) {
-      stores[store.name as keyof T] = store.state() as T[keyof T];
-    } else {
+    if (store) {} else {
       registry.delete(name);
       sendToDevtools({ type: `[${name}] - @Removal` });

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:97:12
     const store = storeRef.deref();
     if (store) {
       stores[store.name as keyof T] = store.state() as T[keyof T];
-    } else {
-      registry.delete(name);
-      sendToDevtools({ type: `[${name}] - @Removal` });
-    }
+    } else {}
   });
 

[NoCoverage] StringLiteral
src/lib/store-plugin-devtools/plugin-devtools.ts:99:30
       stores[store.name as keyof T] = store.state() as T[keyof T];
     } else {
       registry.delete(name);
-      sendToDevtools({ type: `[${name}] - @Removal` });
+      sendToDevtools({ type: `` });
     }
   });

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:110:54
  * Sends an action to the Redux DevTools extension.
  * @param action Action to send.
  */
-export function sendToDevtools(action: Action): void {
-  devtools?.send(action, scavengeAndGetStoresSnapshot());
-}
+export function sendToDevtools(action: Action): void {}
 
 /**

[NoCoverage] OptionalChaining
src/lib/store-plugin-devtools/plugin-devtools.ts:111:3
  * @param action Action to send.
  */
 export function sendToDevtools(action: Action): void {
-  devtools?.send(action, scavengeAndGetStoresSnapshot());
+  devtools.send(action, scavengeAndGetStoresSnapshot());
 }
 

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:118:64
  * Handles messages received from the Redux DevTools extension.
  * @param message DevTools message.
  */
-function handleDevtoolsMessage(message: DevtoolsMessage): void {
-  if (devtools) {
-    if (message.type === 'DISPATCH') {
-      const payloadType = message.payload.type;
-
-      if (payloadType === 'COMMIT') {
-        devtools.init(scavengeAndGetStoresSnapshot());
-        return;
-      }
-
-      if (payloadType === 'JUMP_TO_STATE' || payloadType === 'JUMP_TO_ACTION') {
-        const state = JSON.parse(message.state);
-
-        for (const [name, value] of Object.entries(state)) {
-          const store = getStore(name);
-          if (store) {
-            store['_state'].set(value);
-          }
-        }
-      }
-    }
-  }
-}
+function handleDevtoolsMessage(message: DevtoolsMessage): void {}
 
 /**

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:119:17
  * @param message DevTools message.
  */
 function handleDevtoolsMessage(message: DevtoolsMessage): void {
-  if (devtools) {
-    if (message.type === 'DISPATCH') {
-      const payloadType = message.payload.type;
-
-      if (payloadType === 'COMMIT') {
-        devtools.init(scavengeAndGetStoresSnapshot());
-        return;
-      }
-
-      if (payloadType === 'JUMP_TO_STATE' || payloadType === 'JUMP_TO_ACTION') {
-        const state = JSON.parse(message.state);
-
-        for (const [name, value] of Object.entries(state)) {
-          const store = getStore(name);
-          if (store) {
-            store['_state'].set(value);
-          }
-        }
-      }
-    }
-  }
+  if (devtools) {}
 }
 

[NoCoverage] ConditionalExpression
src/lib/store-plugin-devtools/plugin-devtools.ts:119:7
  * @param message DevTools message.
  */
 function handleDevtoolsMessage(message: DevtoolsMessage): void {
-  if (devtools) {
+  if (true) {
     if (message.type === 'DISPATCH') {
       const payloadType = message.payload.type;

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:120:38
  */
 function handleDevtoolsMessage(message: DevtoolsMessage): void {
   if (devtools) {
-    if (message.type === 'DISPATCH') {
-      const payloadType = message.payload.type;
-
-      if (payloadType === 'COMMIT') {
-        devtools.init(scavengeAndGetStoresSnapshot());
-        return;
-      }
-
-      if (payloadType === 'JUMP_TO_STATE' || payloadType === 'JUMP_TO_ACTION') {
-        const state = JSON.parse(message.state);
-
-        for (const [name, value] of Object.entries(state)) {
-          const store = getStore(name);
-          if (store) {
-            store['_state'].set(value);
-          }
-        }
-      }
-    }
+    if (message.type === 'DISPATCH') {}
   }
 }

[NoCoverage] EqualityOperator
src/lib/store-plugin-devtools/plugin-devtools.ts:120:9
  */
 function handleDevtoolsMessage(message: DevtoolsMessage): void {
   if (devtools) {
-    if (message.type === 'DISPATCH') {
+    if (message.type !== 'DISPATCH') {
       const payloadType = message.payload.type;
 

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:123:37
     if (message.type === 'DISPATCH') {
       const payloadType = message.payload.type;
 
-      if (payloadType === 'COMMIT') {
-        devtools.init(scavengeAndGetStoresSnapshot());
-        return;
-      }
+      if (payloadType === 'COMMIT') {}
 
       if (payloadType === 'JUMP_TO_STATE' || payloadType === 'JUMP_TO_ACTION') {

[NoCoverage] EqualityOperator
src/lib/store-plugin-devtools/plugin-devtools.ts:123:11
     if (message.type === 'DISPATCH') {
       const payloadType = message.payload.type;
 
-      if (payloadType === 'COMMIT') {
+      if (payloadType !== 'COMMIT') {
         devtools.init(scavengeAndGetStoresSnapshot());
         return;

[NoCoverage] EqualityOperator
src/lib/store-plugin-devtools/plugin-devtools.ts:128:46
         return;
       }
 
-      if (payloadType === 'JUMP_TO_STATE' || payloadType === 'JUMP_TO_ACTION') {
+      if (payloadType === 'JUMP_TO_STATE' || payloadType !== 'JUMP_TO_ACTION') {
         const state = JSON.parse(message.state);
 

[NoCoverage] ConditionalExpression
src/lib/store-plugin-devtools/plugin-devtools.ts:128:46
         return;
       }
 
-      if (payloadType === 'JUMP_TO_STATE' || payloadType === 'JUMP_TO_ACTION') {
+      if (payloadType === 'JUMP_TO_STATE' || false) {
         const state = JSON.parse(message.state);
 

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:131:60
       if (payloadType === 'JUMP_TO_STATE' || payloadType === 'JUMP_TO_ACTION') {
         const state = JSON.parse(message.state);
 
-        for (const [name, value] of Object.entries(state)) {
-          const store = getStore(name);
-          if (store) {
-            store['_state'].set(value);
-          }
-        }
+        for (const [name, value] of Object.entries(state)) {}
       }
     }

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:133:22
 
         for (const [name, value] of Object.entries(state)) {
           const store = getStore(name);
-          if (store) {
-            store['_state'].set(value);
-          }
+          if (store) {}
         }
       }

[NoCoverage] ConditionalExpression
src/lib/store-plugin-devtools/plugin-devtools.ts:133:15
 
         for (const [name, value] of Object.entries(state)) {
           const store = getStore(name);
-          if (store) {
+          if (true) {
             store['_state'].set(value);
           }

[NoCoverage] StringLiteral
src/lib/store-plugin-devtools/plugin-devtools.ts:134:19
         for (const [name, value] of Object.entries(state)) {
           const store = getStore(name);
           if (store) {
-            store['_state'].set(value);
+            store[""].set(value);
           }
         }

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:149:3
  */
 export function registerForDevtools<TStore extends Store<unknown>>(
   store: TStore
-) {
-  if (!devtools) {
-    initDevtools({});
-  }
-  registry.set(store.name, new WeakRef(store));
-  sendToDevtools({ type: `[${store.name}] - @Init` });
-}
+) {}
 
 /**

[NoCoverage] ConditionalExpression
src/lib/store-plugin-devtools/plugin-devtools.ts:150:7
 export function registerForDevtools<TStore extends Store<unknown>>(
   store: TStore
 ) {
-  if (!devtools) {
+  if (false) {
     initDevtools({});
   }

[NoCoverage] BooleanLiteral
src/lib/store-plugin-devtools/plugin-devtools.ts:150:7
 export function registerForDevtools<TStore extends Store<unknown>>(
   store: TStore
 ) {
-  if (!devtools) {
+  if (devtools) {
     initDevtools({});
   }

[NoCoverage] StringLiteral
src/lib/store-plugin-devtools/plugin-devtools.ts:154:26
     initDevtools({});
   }
   registry.set(store.name, new WeakRef(store));
-  sendToDevtools({ type: `[${store.name}] - @Init` });
+  sendToDevtools({ type: `` });
 }
 

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:164:3
  */
 export function removeFromDevtools<TStore extends Store<unknown>>(
   store: TStore
-) {
-  registry.delete(store.name);
-  sendToDevtools({ type: `[${store.name}] - @Removal` });
-}
+) {}
 
 /**

[NoCoverage] ObjectLiteral
src/lib/store-plugin-devtools/plugin-devtools.ts:166:18
   store: TStore
 ) {
   registry.delete(store.name);
-  sendToDevtools({ type: `[${store.name}] - @Removal` });
+  sendToDevtools({});
 }
 

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:173:44
  * Enables Storeplugin that links the store activity with the Redux DevTools extension.
  * @returns Devtools Storeplugin
  */
-export function useDevtools(): StorePlugin {
-  return {
-    init(store) {
-      registerForDevtools(store);
-    },
-    postprocessCommand(store, command) {
-      sendToDevtools({
-        type: `[${store.name}] - ${command ?? 'Command'}`,
-      });
-    },
-  };
-}
+export function useDevtools(): StorePlugin {}
 

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:175:17
  */
 export function useDevtools(): StorePlugin {
   return {
-    init(store) {
-      registerForDevtools(store);
-    },
+    init(store) {},
     postprocessCommand(store, command) {
       sendToDevtools({

[NoCoverage] BlockStatement
src/lib/store-plugin-devtools/plugin-devtools.ts:178:40
     init(store) {
       registerForDevtools(store);
     },
-    postprocessCommand(store, command) {
-      sendToDevtools({
-        type: `[${store.name}] - ${command ?? 'Command'}`,
-      });
-    },
+    postprocessCommand(store, command) {},
   };
 }

[NoCoverage] LogicalOperator
src/lib/store-plugin-devtools/plugin-devtools.ts:180:36
     },
     postprocessCommand(store, command) {
       sendToDevtools({
-        type: `[${store.name}] - ${command ?? 'Command'}`,
+        type: `[${store.name}] - ${command && 'Command'}`,
       });
     },

[NoCoverage] StringLiteral
src/lib/store-plugin-devtools/plugin-devtools.ts:180:15
     },
     postprocessCommand(store, command) {
       sendToDevtools({
-        type: `[${store.name}] - ${command ?? 'Command'}`,
+        type: ``,
       });
     },
