[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:25:9
  */
 export function registerStateHistory<TStore extends Store<any>>(
   store: TStore
-): void {
-  storeHistoryRegistry.set(store, []);
-}
+): void {}
 
 /**
killedBy: addToHistory with mutable store should clone and add an item to history if history is enabled
statusReason: Error: Attempted to call addToHistory on Store but history is disabled for this store

[NoCoverage] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:35:9
  */
 export function clearStateHistory<TStore extends Store<any>>(
   store: TStore
-): void {
-  storeHistoryRegistry.delete(store);
-}
+): void {}
 
 /**

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:46:51
  */
 export function getHistory<TStore extends Store<any>>(
   store: TStore
-): ReadonlyArray<HistoryItem<StoreState<TStore>>> {
-  const history = storeHistoryRegistry.get(store);
-  return history
-    ? (history as ReadonlyArray<HistoryItem<StoreState<TStore>>>)
-    : [];
-}
+): ReadonlyArray<HistoryItem<StoreState<TStore>>> {}
 
 /**
killedBy: addToHistory with mutable store should clone and add an item to history if history is enabled
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [{"before": {"value": 10}, "command": "Command"}]
Received: undefined

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:61:9
 export function addToHistory<TStore extends Store<any>>(
   store: TStore,
   command: string
-): void {
-  const history = storeHistoryRegistry.get(store);
-  if (history) {
-    const stateBeforeCommand =
-      store instanceof ImmutableStore
-        ? store.state()
-        : deepClone(store.state());
-    addToHistoryUtil(history, command, stateBeforeCommand);
-  } else {
-    throw new Error(
-      `Attempted to call addToHistory on ${store.name} but history is disabled for this store`
-    );
-  }
-}
+): void {}
 
 /**
killedBy: addToHistory with mutable store should clone and add an item to history if history is enabled
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "before": Object {

[Killed] ConditionalExpression
src/lib/store-plugin-history/plugin-history.ts:63:7
   command: string
 ): void {
   const history = storeHistoryRegistry.get(store);
-  if (history) {
+  if (false) {
     const stateBeforeCommand =
       store instanceof ImmutableStore
killedBy: addToHistory with mutable store should clone and add an item to history if history is enabled
statusReason: Error: Attempted to call addToHistory on Store but history is disabled for this store

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:63:16
   command: string
 ): void {
   const history = storeHistoryRegistry.get(store);
-  if (history) {
-    const stateBeforeCommand =
-      store instanceof ImmutableStore
-        ? store.state()
-        : deepClone(store.state());
-    addToHistoryUtil(history, command, stateBeforeCommand);
-  } else {
+  if (history) {} else {
     throw new Error(
       `Attempted to call addToHistory on ${store.name} but history is disabled for this store`
killedBy: addToHistory with mutable store should clone and add an item to history if history is enabled
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "before": Object {

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:69:10
         ? store.state()
         : deepClone(store.state());
     addToHistoryUtil(history, command, stateBeforeCommand);
-  } else {
-    throw new Error(
-      `Attempted to call addToHistory on ${store.name} but history is disabled for this store`
-    );
-  }
+  } else {}
 }
 
killedBy: addToHistory with mutable store should not add an item to history if history is disabled
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:80:70
  * Undoes the last command for a store.
  * @param store The store to perform the undo operation on.
  */
-export function undo<TStore extends Store<any>>(store: TStore): void {
-  const history = storeHistoryRegistry.get(store) as History<
-    StoreState<TStore>
-  >;
-  if (history) {
-    const result = undoUtil(history, store.state());
-    if (result) {
-      store.set(result.newState, result.command);
-    }
-  } else {
-    throw new Error(
-      `Attempted to call undo on ${store.name} but history is disabled for this store`
-    );
-  }
-}
+export function undo<TStore extends Store<any>>(store: TStore): void {}
 
 /**
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] ConditionalExpression
src/lib/store-plugin-history/plugin-history.ts:84:7
   const history = storeHistoryRegistry.get(store) as History<
     StoreState<TStore>
   >;
-  if (history) {
+  if (false) {
     const result = undoUtil(history, store.state());
     if (result) {
killedBy: undo should do nothing if history is disabled
statusReason: Error: Attempted to call undo on Store but history is disabled for this store

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:84:16
   const history = storeHistoryRegistry.get(store) as History<
     StoreState<TStore>
   >;
-  if (history) {
-    const result = undoUtil(history, store.state());
-    if (result) {
-      store.set(result.newState, result.command);
-    }
-  } else {
+  if (history) {} else {
     throw new Error(
       `Attempted to call undo on ${store.name} but history is disabled for this store`
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:86:17
   >;
   if (history) {
     const result = undoUtil(history, store.state());
-    if (result) {
-      store.set(result.newState, result.command);
-    }
+    if (result) {}
   } else {
     throw new Error(
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] ConditionalExpression
src/lib/store-plugin-history/plugin-history.ts:86:9
   >;
   if (history) {
     const result = undoUtil(history, store.state());
-    if (result) {
+    if (true) {
       store.set(result.newState, result.command);
     }
killedBy: undo should do nothing if history is disabled
statusReason: TypeError: Cannot read properties of null (reading 'newState')

[NoCoverage] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:89:10
     if (result) {
       store.set(result.newState, result.command);
     }
-  } else {
-    throw new Error(
-      `Attempted to call undo on ${store.name} but history is disabled for this store`
-    );
-  }
+  } else {}
 }
 

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:100:70
  * Redoes the last undone command for a store.
  * @param store The store to perform the redo operation on.
  */
-export function redo<TStore extends Store<any>>(store: TStore): void {
-  const history = storeHistoryRegistry.get(store) as History<
-    StoreState<TStore>
-  >;
-
-  if (history) {
-    const result = redoUtil(history, store.state());
-    if (result) {
-      store.set(result.newState, result.command);
-    }
-  } else {
-    throw new Error(
-      `Attempted to call redo on ${store.name} but history is disabled for this store`
-    );
-  }
-}
+export function redo<TStore extends Store<any>>(store: TStore): void {}
 
 /**
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] ConditionalExpression
src/lib/store-plugin-history/plugin-history.ts:105:7
     StoreState<TStore>
   >;
 
-  if (history) {
+  if (false) {
     const result = redoUtil(history, store.state());
     if (result) {
killedBy: redo should do nothing if history is disabled
statusReason: Error: Attempted to call redo on Store but history is disabled for this store

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:105:16
     StoreState<TStore>
   >;
 
-  if (history) {
-    const result = redoUtil(history, store.state());
-    if (result) {
-      store.set(result.newState, result.command);
-    }
-  } else {
+  if (history) {} else {
     throw new Error(
       `Attempted to call redo on ${store.name} but history is disabled for this store`
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:107:17
 
   if (history) {
     const result = redoUtil(history, store.state());
-    if (result) {
-      store.set(result.newState, result.command);
-    }
+    if (result) {}
   } else {
     throw new Error(
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] ConditionalExpression
src/lib/store-plugin-history/plugin-history.ts:107:9
 
   if (history) {
     const result = redoUtil(history, store.state());
-    if (result) {
+    if (true) {
       store.set(result.newState, result.command);
     }
killedBy: redo should do nothing if history is disabled
statusReason: TypeError: Cannot read properties of null (reading 'newState')

[NoCoverage] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:110:10
     if (result) {
       store.set(result.newState, result.command);
     }
-  } else {
-    throw new Error(
-      `Attempted to call redo on ${store.name} but history is disabled for this store`
-    );
-  }
+  } else {}
 }
 

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:125:48
  *
  * @returns History Storeplugin.
  */
-export function useStoreHistory(): StorePlugin {
-  return {
-    precedence: 10, // should come early in initialization
-    init(store) {
-      registerStateHistory(store);
-    },
-    preprocessCommand(store, command) {
-      addToHistory(store, command ?? 'Unspecified Command');
-    },
-  };
-}
+export function useStoreHistory(): StorePlugin {}
 
killedBy: addToHistory with mutable store should clone and add an item to history if history is enabled
statusReason: TypeError: Cannot read properties of undefined (reading 'init')

[Killed] ObjectLiteral
src/lib/store-plugin-history/plugin-history.ts:126:10
  * @returns History Storeplugin.
  */
 export function useStoreHistory(): StorePlugin {
-  return {
-    precedence: 10, // should come early in initialization
-    init(store) {
-      registerStateHistory(store);
-    },
-    preprocessCommand(store, command) {
-      addToHistory(store, command ?? 'Unspecified Command');
-    },
-  };
+  return {};
 }
 
killedBy: undo should do nothing if history is disabled
statusReason: Error: Attempted to call undo on Store but history is disabled for this store

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:128:17
 export function useStoreHistory(): StorePlugin {
   return {
     precedence: 10, // should come early in initialization
-    init(store) {
-      registerStateHistory(store);
-    },
+    init(store) {},
     preprocessCommand(store, command) {
       addToHistory(store, command ?? 'Unspecified Command');
killedBy: undo should do nothing if history is disabled
statusReason: Error: Attempted to call undo on Store but history is disabled for this store

[Killed] BlockStatement
src/lib/store-plugin-history/plugin-history.ts:131:39
     init(store) {
       registerStateHistory(store);
     },
-    preprocessCommand(store, command) {
-      addToHistory(store, command ?? 'Unspecified Command');
-    },
+    preprocessCommand(store, command) {},
   };
 }
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] LogicalOperator
src/lib/store-plugin-history/plugin-history.ts:132:27
       registerStateHistory(store);
     },
     preprocessCommand(store, command) {
-      addToHistory(store, command ?? 'Unspecified Command');
+      addToHistory(store, command && 'Unspecified Command');
     },
   };
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 8

  Array [
    Object {
      "before": Object {
