[NoCoverage] StringLiteral
src/lib/store-plugin-logger/plugin-logger.ts:29:11
   options: StoreLoggerPluginOptions = {}
 ): StorePlugin & { log: Logger; name: string } {
   const plugin: StorePlugin & { log: Logger; name: string } = {
-    name: 'StoreLogger',
+    name: "",
     log: options.logFunction ?? console.log,
   };

[NoCoverage] LogicalOperator
src/lib/store-plugin-logger/plugin-logger.ts:30:10
 ): StorePlugin & { log: Logger; name: string } {
   const plugin: StorePlugin & { log: Logger; name: string } = {
     name: 'StoreLogger',
-    log: options.logFunction ?? console.log,
+    log: options.logFunction && console.log,
   };
 

[NoCoverage] ArrowFunction
src/lib/store-plugin-logger/plugin-logger.ts:33:17
     log: options.logFunction ?? console.log,
   };
 
-  plugin.init = store => plugin.log(`[${store.name}->Init]`, store.state());
+  plugin.init = () => undefined;
   plugin.postprocessCommand = (store, command) =>
     plugin.log(

[NoCoverage] ArrowFunction
src/lib/store-plugin-logger/plugin-logger.ts:34:31
   };
 
   plugin.init = store => plugin.log(`[${store.name}->Init]`, store.state());
-  plugin.postprocessCommand = (store, command) =>
-    plugin.log(
-      `[${store.name}->Command] ${command ?? 'Unspecified'}`,
-      store.state()
-    );
+  plugin.postprocessCommand = () => undefined;
   plugin.preprocessEffect = (store, effect) =>
     plugin.log(

[NoCoverage] LogicalOperator
src/lib/store-plugin-logger/plugin-logger.ts:36:35
   plugin.init = store => plugin.log(`[${store.name}->Init]`, store.state());
   plugin.postprocessCommand = (store, command) =>
     plugin.log(
-      `[${store.name}->Command] ${command ?? 'Unspecified'}`,
+      `[${store.name}->Command] ${command && 'Unspecified'}`,
       store.state()
     );

[NoCoverage] ArrowFunction
src/lib/store-plugin-logger/plugin-logger.ts:39:29
       `[${store.name}->Command] ${command ?? 'Unspecified'}`,
       store.state()
     );
-  plugin.preprocessEffect = (store, effect) =>
-    plugin.log(
-      `[${store.name}->Effect STARTED] ${effect.name ?? 'Unspecified'}`,
-      store.state()
-    );
+  plugin.preprocessEffect = () => undefined;
   plugin.postprocessEffect = (store, effect, result) =>
     withSideEffect(result, () => {

[NoCoverage] LogicalOperator
src/lib/store-plugin-logger/plugin-logger.ts:41:42
     );
   plugin.preprocessEffect = (store, effect) =>
     plugin.log(
-      `[${store.name}->Effect STARTED] ${effect.name ?? 'Unspecified'}`,
+      `[${store.name}->Effect STARTED] ${effect.name && 'Unspecified'}`,
       store.state()
     );

[NoCoverage] ArrowFunction
src/lib/store-plugin-logger/plugin-logger.ts:44:30
       `[${store.name}->Effect STARTED] ${effect.name ?? 'Unspecified'}`,
       store.state()
     );
-  plugin.postprocessEffect = (store, effect, result) =>
-    withSideEffect(result, () => {
-      plugin.log(
-        `[${store.name}->Effect FINNISHED] ${effect.name ?? 'Unspecified'}`,
-        store.state()
-      );
-    });
+  plugin.postprocessEffect = () => undefined;
 
   return plugin;

[NoCoverage] BlockStatement
src/lib/store-plugin-logger/plugin-logger.ts:45:34
       store.state()
     );
   plugin.postprocessEffect = (store, effect, result) =>
-    withSideEffect(result, () => {
-      plugin.log(
-        `[${store.name}->Effect FINNISHED] ${effect.name ?? 'Unspecified'}`,
-        store.state()
-      );
-    });
+    withSideEffect(result, () => {});
 
   return plugin;

[NoCoverage] LogicalOperator
src/lib/store-plugin-logger/plugin-logger.ts:47:46
   plugin.postprocessEffect = (store, effect, result) =>
     withSideEffect(result, () => {
       plugin.log(
-        `[${store.name}->Effect FINNISHED] ${effect.name ?? 'Unspecified'}`,
+        `[${store.name}->Effect FINNISHED] ${effect.name && 'Unspecified'}`,
         store.state()
       );

[NoCoverage] StringLiteral
src/lib/store-plugin-logger/plugin-logger.ts:47:9
   plugin.postprocessEffect = (store, effect, result) =>
     withSideEffect(result, () => {
       plugin.log(
-        `[${store.name}->Effect FINNISHED] ${effect.name ?? 'Unspecified'}`,
+        ``,
         store.state()
       );
