[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:40:34
  */
 function isStorePersistencePlugin(
   obj: StorePlugin
-): obj is StorePersistencePlugin {
-  return (
-    obj &&
-    typeof obj === 'object' &&
-    'storage' in obj &&
-    'getPersistenceKeyFromStore' in obj
-  );
-}
+): obj is StorePersistencePlugin {}
 
 /**
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"val": "initial"}
Received: undefined

[Killed] ConditionalExpression
src/lib/store-plugin-persistence/plugin-persistence.ts:42:5
   obj: StorePlugin
 ): obj is StorePersistencePlugin {
   return (
-    obj &&
-    typeof obj === 'object' &&
-    'storage' in obj &&
-    'getPersistenceKeyFromStore' in obj
+    false
   );
 }
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"val": "initial"}
Received: undefined

[Killed] ConditionalExpression
src/lib/store-plugin-persistence/plugin-persistence.ts:42:5
   obj: StorePlugin
 ): obj is StorePersistencePlugin {
   return (
-    obj &&
-    typeof obj === 'object' &&
-    'storage' in obj &&
-    'getPersistenceKeyFromStore' in obj
+    true
   );
 }
killedBy: registration should come first in ordering
statusReason: TypeError: plugin.getPersistenceKeyFromStore is not a function

[Killed] EqualityOperator
src/lib/store-plugin-persistence/plugin-persistence.ts:43:5
 ): obj is StorePersistencePlugin {
   return (
     obj &&
-    typeof obj === 'object' &&
+    typeof obj !== 'object' &&
     'storage' in obj &&
     'getPersistenceKeyFromStore' in obj
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"val": "initial"}
Received: undefined

[Survived] ConditionalExpression
src/lib/store-plugin-persistence/plugin-persistence.ts:43:5
 ): obj is StorePersistencePlugin {
   return (
     obj &&
-    typeof obj === 'object' &&
+    true &&
     'storage' in obj &&
     'getPersistenceKeyFromStore' in obj

[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:56:60
  * @param store - The store instance.
  *
  */
-export function clearStoreStorage(store: Store<any>): void {
-  const plugin = store.config.plugins.find(isStorePersistencePlugin);
-  if (plugin) {
-    clearStorage(plugin.storage, plugin.getPersistenceKeyFromStore(store));
-  } else {
-    throw new Error(
-      `Store persistence plugin is not enabed for store ${store.config.name}`
-    );
-  }
-}
+export function clearStoreStorage(store: Store<any>): void {}
 
 /**
killedBy: clearStorage should remove the stored value from persistence storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myStoreKey"

Number of calls: 0

[Killed] ConditionalExpression
src/lib/store-plugin-persistence/plugin-persistence.ts:58:7
  */
 export function clearStoreStorage(store: Store<any>): void {
   const plugin = store.config.plugins.find(isStorePersistencePlugin);
-  if (plugin) {
+  if (false) {
     clearStorage(plugin.storage, plugin.getPersistenceKeyFromStore(store));
   } else {
killedBy: clearStorage should remove the stored value from persistence storage
statusReason: Error: Store persistence plugin is not enabed for store TestStore

[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:58:15
  */
 export function clearStoreStorage(store: Store<any>): void {
   const plugin = store.config.plugins.find(isStorePersistencePlugin);
-  if (plugin) {
-    clearStorage(plugin.storage, plugin.getPersistenceKeyFromStore(store));
-  } else {
+  if (plugin) {} else {
     throw new Error(
       `Store persistence plugin is not enabed for store ${store.config.name}`
killedBy: clearStorage should remove the stored value from persistence storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myStoreKey"

Number of calls: 0

[NoCoverage] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:60:10
   const plugin = store.config.plugins.find(isStorePersistencePlugin);
   if (plugin) {
     clearStorage(plugin.storage, plugin.getPersistenceKeyFromStore(store));
-  } else {
-    throw new Error(
-      `Store persistence plugin is not enabed for store ${store.config.name}`
-    );
-  }
+  } else {}
 }
 

[NoCoverage] StringLiteral
src/lib/store-plugin-persistence/plugin-persistence.ts:62:7
     clearStorage(plugin.storage, plugin.getPersistenceKeyFromStore(store));
   } else {
     throw new Error(
-      `Store persistence plugin is not enabed for store ${store.config.name}`
+      ``
     );
   }

[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:76:9
 export function saveToStoreStorage<TStore extends Store<any>>(
   store: TStore,
   state: StoreState<TStore>
-): void {
-  const plugin = store.config.plugins.find(isStorePersistencePlugin);
-  if (plugin) {
-    saveToStorage(
-      plugin.storage,
-      plugin.getPersistenceKeyFromStore(store),
-      state
-    );
-  }
-}
+): void {}
 
 /**
killedBy: saveToStorage should save the store state to persistence storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myStoreKey", "{\"val\":\"initial\"}"

Number of calls: 0

[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:78:15
   state: StoreState<TStore>
 ): void {
   const plugin = store.config.plugins.find(isStorePersistencePlugin);
-  if (plugin) {
-    saveToStorage(
-      plugin.storage,
-      plugin.getPersistenceKeyFromStore(store),
-      state
-    );
-  }
+  if (plugin) {}
 }
 
killedBy: saveToStorage should save the store state to persistence storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myStoreKey", "{\"val\":\"initial\"}"

Number of calls: 0

[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:95:35
  */
 export function loadFromStoreStorage<TStore extends Store<any>>(
   store: TStore
-): StoreState<TStore> | undefined {
-  const plugin = store.config.plugins.find(isStorePersistencePlugin);
-  return plugin
-    ? loadFromStorage(plugin.storage, plugin.getPersistenceKeyFromStore(store))
-    : undefined;
-}
+): StoreState<TStore> | undefined {}
 
 /**
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"val": "initial"}
Received: undefined

[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:110:27
  */
 export function useStorePersistence(
   options: StorePersistencePluginOptions = {}
-): StorePersistencePlugin {
-  const plugin: StorePersistencePlugin = {
-    storage: options.persistenceStorage ?? localStorage,
-    getPersistenceKeyFromStore: store =>
-      options.persistenceKey ?? `_persisted_state_of_${store.config.name}`,
-    init(store) {
-      const persistedState = loadFromStoreStorage(store);
-      if (persistedState) {
-        store.set(persistedState, 'Load state from storage');
-      }
-    },
-    postprocessCommand(store) {
-      saveToStoreStorage(store, store.state());
-    },
-  };
-
-  return plugin;
-}
+): StorePersistencePlugin {}
 
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: TypeError: Cannot read properties of undefined (reading 'init')

[Killed] LogicalOperator
src/lib/store-plugin-persistence/plugin-persistence.ts:112:14
   options: StorePersistencePluginOptions = {}
 ): StorePersistencePlugin {
   const plugin: StorePersistencePlugin = {
-    storage: options.persistenceStorage ?? localStorage,
+    storage: options.persistenceStorage && localStorage,
     getPersistenceKeyFromStore: store =>
       options.persistenceKey ?? `_persisted_state_of_${store.config.name}`,
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"val": "initial"}
Received: undefined

[Killed] ArrowFunction
src/lib/store-plugin-persistence/plugin-persistence.ts:113:33
 ): StorePersistencePlugin {
   const plugin: StorePersistencePlugin = {
     storage: options.persistenceStorage ?? localStorage,
-    getPersistenceKeyFromStore: store =>
-      options.persistenceKey ?? `_persisted_state_of_${store.config.name}`,
+    getPersistenceKeyFromStore: () => undefined,
     init(store) {
       const persistedState = loadFromStoreStorage(store);
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myStoreKey"
Received: undefined

Number of calls: 1

[Killed] LogicalOperator
src/lib/store-plugin-persistence/plugin-persistence.ts:114:7
   const plugin: StorePersistencePlugin = {
     storage: options.persistenceStorage ?? localStorage,
     getPersistenceKeyFromStore: store =>
-      options.persistenceKey ?? `_persisted_state_of_${store.config.name}`,
+      options.persistenceKey && `_persisted_state_of_${store.config.name}`,
     init(store) {
       const persistedState = loadFromStoreStorage(store);
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myStoreKey"
Received: "_persisted_state_of_TestStore"

Number of calls: 1

[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:115:17
     storage: options.persistenceStorage ?? localStorage,
     getPersistenceKeyFromStore: store =>
       options.persistenceKey ?? `_persisted_state_of_${store.config.name}`,
-    init(store) {
-      const persistedState = loadFromStoreStorage(store);
-      if (persistedState) {
-        store.set(persistedState, 'Load state from storage');
-      }
-    },
+    init(store) {},
     postprocessCommand(store) {
       saveToStoreStorage(store, store.state());
killedBy: automatic sync Should initialize from storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "val": "initialFromStorage",
+   "val": "initial",

[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:117:27
       options.persistenceKey ?? `_persisted_state_of_${store.config.name}`,
     init(store) {
       const persistedState = loadFromStoreStorage(store);
-      if (persistedState) {
-        store.set(persistedState, 'Load state from storage');
-      }
+      if (persistedState) {}
     },
     postprocessCommand(store) {
killedBy: automatic sync Should initialize from storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "val": "initialFromStorage",
+   "val": "initial",

[Killed] ConditionalExpression
src/lib/store-plugin-persistence/plugin-persistence.ts:117:11
       options.persistenceKey ?? `_persisted_state_of_${store.config.name}`,
     init(store) {
       const persistedState = loadFromStoreStorage(store);
-      if (persistedState) {
+      if (false) {
         store.set(persistedState, 'Load state from storage');
       }
killedBy: automatic sync Should initialize from storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "val": "initialFromStorage",
+   "val": "initial",

[Survived] StringLiteral
src/lib/store-plugin-persistence/plugin-persistence.ts:118:35
     init(store) {
       const persistedState = loadFromStoreStorage(store);
       if (persistedState) {
-        store.set(persistedState, 'Load state from storage');
+        store.set(persistedState, "");
       }
     },

[Killed] BlockStatement
src/lib/store-plugin-persistence/plugin-persistence.ts:121:31
         store.set(persistedState, 'Load state from storage');
       }
     },
-    postprocessCommand(store) {
-      saveToStoreStorage(store, store.state());
-    },
+    postprocessCommand(store) {},
   };
 
killedBy: automatic sync should persist new state
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
