[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:28:64
  * @param store - The store to check for modification status.
  * @returns Signal<boolean> - A signal indicating whether the store has been modified.
  */
-export function isModified(store: Store<any>): Signal<boolean> {
-  const modifiedStatus = isStoreModifiedMap.get(store);
-  if (!modifiedStatus) {
-    throw new Error(
-      `StatusPlugin has not been activated for store ${store.name}`
-    );
-  }
-
-  return computed(() => modifiedStatus());
-}
+export function isModified(store: Store<any>): Signal<boolean> {}
 
 /**
killedBy: isModified should be unmodified initially
statusReason: TypeError: (0 , plugin_status_1.isModified)(...) is not a function

[Killed] BooleanLiteral
src/lib/store-plugin-status/plugin-status.ts:30:7
  */
 export function isModified(store: Store<any>): Signal<boolean> {
   const modifiedStatus = isStoreModifiedMap.get(store);
-  if (!modifiedStatus) {
+  if (modifiedStatus) {
     throw new Error(
       `StatusPlugin has not been activated for store ${store.name}`
killedBy: isModified should be unmodified initially
statusReason: Error: StatusPlugin has not been activated for store Store

[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:30:7
  */
 export function isModified(store: Store<any>): Signal<boolean> {
   const modifiedStatus = isStoreModifiedMap.get(store);
-  if (!modifiedStatus) {
+  if (true) {
     throw new Error(
       `StatusPlugin has not been activated for store ${store.name}`
killedBy: isModified should be unmodified initially
statusReason: Error: StatusPlugin has not been activated for store Store

[NoCoverage] StringLiteral
src/lib/store-plugin-status/plugin-status.ts:32:7
   const modifiedStatus = isStoreModifiedMap.get(store);
   if (!modifiedStatus) {
     throw new Error(
-      `StatusPlugin has not been activated for store ${store.name}`
+      ``
     );
   }

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:36:19
     );
   }
 
-  return computed(() => modifiedStatus());
+  return computed(() => undefined);
 }
 
killedBy: isModified should be unmodified initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:48:59
  * @param store - The store to manually mark as unmodified.
  * @returns void
  */
-export function markAsUnmodified(store: Store<any>): void {
-  isStoreModifiedMap.get(store)?.set(false);
-}
+export function markAsUnmodified(store: Store<any>): void {}
 
 /**
killedBy: markAsUnmodified should manually mark the store as unmodified
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/lib/store-plugin-status/plugin-status.ts:49:38
  * @returns void
  */
 export function markAsUnmodified(store: Store<any>): void {
-  isStoreModifiedMap.get(store)?.set(false);
+  isStoreModifiedMap.get(store)?.set(true);
 }
 
killedBy: markAsUnmodified should manually mark the store as unmodified
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] OptionalChaining
src/lib/store-plugin-status/plugin-status.ts:49:3
  * @returns void
  */
 export function markAsUnmodified(store: Store<any>): void {
-  isStoreModifiedMap.get(store)?.set(false);
+  isStoreModifiedMap.get(store).set(false);
 }
 

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:61:69
  * @param stores - Stores to check for loading status. If no stores are provided, the signal checks all stores.
  * @returns Signal<boolean> - A signal indicating whether any store is loading.
  */
-export function isLoading(...stores: Store<any>[]): Signal<boolean> {
-  if (!stores || stores.length === 0) {
-    return computed(() =>
-      runningEffects().some(effect => effect[1].config.setLoadingStatus)
-    );
-  } else {
-    return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return (
-          affectedStore &&
-          runningEffect[1].config.setLoadingStatus &&
-          stores.some(store => store === affectedStore)
-        );
-      })
-    );
-  }
-}
+export function isLoading(...stores: Store<any>[]): Signal<boolean> {}
 
 /**
killedBy: isLoading should be false if no effect is running
statusReason: TypeError: (0 , plugin_status_1.isLoading)(...) is not a function

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:62:39
  * @returns Signal<boolean> - A signal indicating whether any store is loading.
  */
 export function isLoading(...stores: Store<any>[]): Signal<boolean> {
-  if (!stores || stores.length === 0) {
-    return computed(() =>
-      runningEffects().some(effect => effect[1].config.setLoadingStatus)
-    );
-  } else {
+  if (!stores || stores.length === 0) {} else {
     return computed(() =>
       runningEffects().some(runningEffect => {
killedBy: isLoading should be false if no effect is running
statusReason: TypeError: (0 , plugin_status_1.isLoading)(...) is not a function

[Killed] LogicalOperator
src/lib/store-plugin-status/plugin-status.ts:62:7
  * @returns Signal<boolean> - A signal indicating whether any store is loading.
  */
 export function isLoading(...stores: Store<any>[]): Signal<boolean> {
-  if (!stores || stores.length === 0) {
+  if (!stores && stores.length === 0) {
     return computed(() =>
       runningEffects().some(effect => effect[1].config.setLoadingStatus)
killedBy: isLoading should be true for a running effect that has been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:63:21
  */
 export function isLoading(...stores: Store<any>[]): Signal<boolean> {
   if (!stores || stores.length === 0) {
-    return computed(() =>
-      runningEffects().some(effect => effect[1].config.setLoadingStatus)
+    return computed(() => undefined
     );
   } else {
killedBy: isLoading should be false if no effect is running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] MethodExpression
src/lib/store-plugin-status/plugin-status.ts:64:7
 export function isLoading(...stores: Store<any>[]): Signal<boolean> {
   if (!stores || stores.length === 0) {
     return computed(() =>
-      runningEffects().some(effect => effect[1].config.setLoadingStatus)
+      runningEffects().every(effect => effect[1].config.setLoadingStatus)
     );
   } else {
killedBy: isLoading should be false if no effect is running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:64:29
 export function isLoading(...stores: Store<any>[]): Signal<boolean> {
   if (!stores || stores.length === 0) {
     return computed(() =>
-      runningEffects().some(effect => effect[1].config.setLoadingStatus)
+      runningEffects().some(() => undefined)
     );
   } else {
killedBy: isLoading should be true for a running effect that has been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:66:10
     return computed(() =>
       runningEffects().some(effect => effect[1].config.setLoadingStatus)
     );
-  } else {
-    return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return (
-          affectedStore &&
-          runningEffect[1].config.setLoadingStatus &&
-          stores.some(store => store === affectedStore)
-        );
-      })
-    );
-  }
+  } else {}
 }
 
killedBy: isLoading should be false if no effect is running
statusReason: TypeError: (0 , plugin_status_1.isLoading)(...) is not a function

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:67:21
       runningEffects().some(effect => effect[1].config.setLoadingStatus)
     );
   } else {
-    return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return (
-          affectedStore &&
-          runningEffect[1].config.setLoadingStatus &&
-          stores.some(store => store === affectedStore)
-        );
-      })
+    return computed(() => undefined
     );
   }
killedBy: isLoading should be false if no effect is running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] MethodExpression
src/lib/store-plugin-status/plugin-status.ts:68:7
     );
   } else {
     return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return (
-          affectedStore &&
-          runningEffect[1].config.setLoadingStatus &&
-          stores.some(store => store === affectedStore)
-        );
-      })
+      runningEffects().every(runningEffect => {
+  const affectedStore = runningEffect[0].deref();
+  return affectedStore && runningEffect[1].config.setLoadingStatus && stores.some(store => store === affectedStore);
+})
     );
   }
killedBy: isLoading should be false if no effect is running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:68:46
     );
   } else {
     return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return (
-          affectedStore &&
-          runningEffect[1].config.setLoadingStatus &&
-          stores.some(store => store === affectedStore)
-        );
-      })
+      runningEffects().some(runningEffect => {})
     );
   }
killedBy: isLoading should be true for a running effect that has been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/lib/store-plugin-status/plugin-status.ts:71:11
       runningEffects().some(runningEffect => {
         const affectedStore = runningEffect[0].deref();
         return (
-          affectedStore &&
-          runningEffect[1].config.setLoadingStatus &&
+          affectedStore || runningEffect[1].config.setLoadingStatus &&
           stores.some(store => store === affectedStore)
         );
killedBy: isLoading should be false for a running effect that has not been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:71:11
       runningEffects().some(runningEffect => {
         const affectedStore = runningEffect[0].deref();
         return (
-          affectedStore &&
-          runningEffect[1].config.setLoadingStatus &&
-          stores.some(store => store === affectedStore)
+          true
         );
       })
killedBy: isLoading should be false for a running effect that has not been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/lib/store-plugin-status/plugin-status.ts:73:32
         return (
           affectedStore &&
           runningEffect[1].config.setLoadingStatus &&
-          stores.some(store => store === affectedStore)
+          stores.some(store => store !== affectedStore)
         );
       })
killedBy: isLoading should be true for a running effect that has been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:73:23
         return (
           affectedStore &&
           runningEffect[1].config.setLoadingStatus &&
-          stores.some(store => store === affectedStore)
+          stores.some(() => undefined)
         );
       })
killedBy: isLoading should be true for a running effect that has been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:91:71
  * @param store - The store to manually mark as not having running effects.
  * @returns void
  */
-export function markAsHavingNoRunningEffects(store: Store<any>): void {
-  runningEffects.update(state =>
-    state.filter(runningEffect => runningEffect[0].deref() !== store)
-  );
-}
+export function markAsHavingNoRunningEffects(store: Store<any>): void {}
 
 /**
killedBy: markAsHavingNoRunningEffects should manually mark the store as not having running effects
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [[{}, {"config": {"setLoadingStatus": false, "setUnmodifiedStatus": false, "withInjectionContext": true}, "func": [Function anonymous], "name": "dummyEffect"}]]

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:92:25
  * @returns void
  */
 export function markAsHavingNoRunningEffects(store: Store<any>): void {
-  runningEffects.update(state =>
-    state.filter(runningEffect => runningEffect[0].deref() !== store)
+  runningEffects.update(() => undefined
   );
 }
killedBy: markAsHavingNoRunningEffects should manually mark the store as not having running effects
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:93:35
  */
 export function markAsHavingNoRunningEffects(store: Store<any>): void {
   runningEffects.update(state =>
-    state.filter(runningEffect => runningEffect[0].deref() !== store)
+    state.filter(runningEffect => false)
   );
 }
killedBy: markAsHavingNoRunningEffects should not affect effects from other stores
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] MethodExpression
src/lib/store-plugin-status/plugin-status.ts:93:5
  */
 export function markAsHavingNoRunningEffects(store: Store<any>): void {
   runningEffects.update(state =>
-    state.filter(runningEffect => runningEffect[0].deref() !== store)
+    state
   );
 }
killedBy: markAsHavingNoRunningEffects should manually mark the store as not having running effects
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [[{}, {"config": {"setLoadingStatus": false, "setUnmodifiedStatus": false, "withInjectionContext": true}, "func": [Function anonymous], "name": "dummyEffect"}]]

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:103:78
  * @param stores - Stores to check for running effects.
  * @returns Signal<boolean> - A signal indicating whether any effect is running for any store.
  */
-export function isAnyEffectRunning(...stores: Store<any>[]): Signal<boolean> {
-  if (!stores || stores.length === 0) {
-    return computed(() => runningEffects().length > 0);
-  } else {
-    return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return affectedStore && stores.some(store => store === affectedStore);
-      })
-    );
-  }
-}
+export function isAnyEffectRunning(...stores: Store<any>[]): Signal<boolean> {}
 
 /**
killedBy: isAnyEffectRunning should be false if no effect is running
statusReason: TypeError: (0 , plugin_status_1.isAnyEffectRunning)(...) is not a function

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:104:39
  * @returns Signal<boolean> - A signal indicating whether any effect is running for any store.
  */
 export function isAnyEffectRunning(...stores: Store<any>[]): Signal<boolean> {
-  if (!stores || stores.length === 0) {
-    return computed(() => runningEffects().length > 0);
-  } else {
+  if (!stores || stores.length === 0) {} else {
     return computed(() =>
       runningEffects().some(runningEffect => {
killedBy: isAnyEffectRunning should be false if no effect is running
statusReason: TypeError: (0 , plugin_status_1.isAnyEffectRunning)(...) is not a function

[Killed] EqualityOperator
src/lib/store-plugin-status/plugin-status.ts:104:18
  * @returns Signal<boolean> - A signal indicating whether any effect is running for any store.
  */
 export function isAnyEffectRunning(...stores: Store<any>[]): Signal<boolean> {
-  if (!stores || stores.length === 0) {
+  if (!stores || stores.length !== 0) {
     return computed(() => runningEffects().length > 0);
   } else {
killedBy: isAnyEffectRunning should be false for a running effect that is registered for another store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/lib/store-plugin-status/plugin-status.ts:105:27
  */
 export function isAnyEffectRunning(...stores: Store<any>[]): Signal<boolean> {
   if (!stores || stores.length === 0) {
-    return computed(() => runningEffects().length > 0);
+    return computed(() => runningEffects().length >= 0);
   } else {
     return computed(() =>
killedBy: isAnyEffectRunning should be false if no effect is running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/lib/store-plugin-status/plugin-status.ts:105:27
  */
 export function isAnyEffectRunning(...stores: Store<any>[]): Signal<boolean> {
   if (!stores || stores.length === 0) {
-    return computed(() => runningEffects().length > 0);
+    return computed(() => runningEffects().length <= 0);
   } else {
     return computed(() =>
killedBy: isAnyEffectRunning should be false if no effect is running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:106:10
 export function isAnyEffectRunning(...stores: Store<any>[]): Signal<boolean> {
   if (!stores || stores.length === 0) {
     return computed(() => runningEffects().length > 0);
-  } else {
-    return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return affectedStore && stores.some(store => store === affectedStore);
-      })
-    );
-  }
+  } else {}
 }
 
killedBy: isAnyEffectRunning should be false if no effect is running
statusReason: TypeError: (0 , plugin_status_1.isAnyEffectRunning)(...) is not a function

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:107:21
   if (!stores || stores.length === 0) {
     return computed(() => runningEffects().length > 0);
   } else {
-    return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return affectedStore && stores.some(store => store === affectedStore);
-      })
+    return computed(() => undefined
     );
   }
killedBy: isAnyEffectRunning should be false if no effect is running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:108:46
     return computed(() => runningEffects().length > 0);
   } else {
     return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return affectedStore && stores.some(store => store === affectedStore);
-      })
+      runningEffects().some(runningEffect => {})
     );
   }
killedBy: isAnyEffectRunning should be true for a running effect and the corresponding store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/lib/store-plugin-status/plugin-status.ts:108:7
     return computed(() => runningEffects().length > 0);
   } else {
     return computed(() =>
-      runningEffects().some(runningEffect => {
-        const affectedStore = runningEffect[0].deref();
-        return affectedStore && stores.some(store => store === affectedStore);
-      })
+      runningEffects().every(runningEffect => {
+  const affectedStore = runningEffect[0].deref();
+  return affectedStore && stores.some(store => store === affectedStore);
+})
     );
   }
killedBy: isAnyEffectRunning should be false if no effect is running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:110:16
     return computed(() =>
       runningEffects().some(runningEffect => {
         const affectedStore = runningEffect[0].deref();
-        return affectedStore && stores.some(store => store === affectedStore);
+        return true;
       })
     );
killedBy: isAnyEffectRunning should be false for a running effect that is registered for another store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:110:45
     return computed(() =>
       runningEffects().some(runningEffect => {
         const affectedStore = runningEffect[0].deref();
-        return affectedStore && stores.some(store => store === affectedStore);
+        return affectedStore && stores.some(() => undefined);
       })
     );
killedBy: isAnyEffectRunning should be true for a running effect and the corresponding store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:126:20
 export function isEffectRunning(
   effect: StoreEffect<any, any, any>,
   ...stores: Store<any>[]
-): Signal<boolean> {
-  if (!stores || stores.length === 0) {
-    return computed(() => runningEffects().some(x => x[1] === effect));
-  } else {
-    return computed(() =>
-      runningEffects()
-        .filter(runningEffect => runningEffect[1] === effect)
-        .some(runningEffect => {
-          const affectedStore = runningEffect[0].deref();
-          return affectedStore && stores.some(store => store === affectedStore);
-        })
-    );
-  }
-}
+): Signal<boolean> {}
 
 /**
killedBy: isEffectRunning should be false if effect is not running
statusReason: TypeError: (0 , plugin_status_1.isEffectRunning)(...) is not a function

[Killed] BooleanLiteral
src/lib/store-plugin-status/plugin-status.ts:127:7
   effect: StoreEffect<any, any, any>,
   ...stores: Store<any>[]
 ): Signal<boolean> {
-  if (!stores || stores.length === 0) {
+  if (stores || stores.length === 0) {
     return computed(() => runningEffects().some(x => x[1] === effect));
   } else {
killedBy: isEffectRunning should be false for a running effect that is registered for another store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/lib/store-plugin-status/plugin-status.ts:127:7
   effect: StoreEffect<any, any, any>,
   ...stores: Store<any>[]
 ): Signal<boolean> {
-  if (!stores || stores.length === 0) {
+  if (!stores && stores.length === 0) {
     return computed(() => runningEffects().some(x => x[1] === effect));
   } else {
killedBy: isEffectRunning should be false for a running effect that is registered for another store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:128:54
   ...stores: Store<any>[]
 ): Signal<boolean> {
   if (!stores || stores.length === 0) {
-    return computed(() => runningEffects().some(x => x[1] === effect));
+    return computed(() => runningEffects().some(x => false));
   } else {
     return computed(() =>
killedBy: isEffectRunning should be false for a running effect that is registered for another store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:128:54
   ...stores: Store<any>[]
 ): Signal<boolean> {
   if (!stores || stores.length === 0) {
-    return computed(() => runningEffects().some(x => x[1] === effect));
+    return computed(() => runningEffects().some(x => true));
   } else {
     return computed(() =>
killedBy: isEffectRunning should be false if effect is not running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:129:10
 ): Signal<boolean> {
   if (!stores || stores.length === 0) {
     return computed(() => runningEffects().some(x => x[1] === effect));
-  } else {
-    return computed(() =>
-      runningEffects()
-        .filter(runningEffect => runningEffect[1] === effect)
-        .some(runningEffect => {
-          const affectedStore = runningEffect[0].deref();
-          return affectedStore && stores.some(store => store === affectedStore);
-        })
-    );
-  }
+  } else {}
 }
 
killedBy: isEffectRunning should be false if effect is not running
statusReason: TypeError: (0 , plugin_status_1.isEffectRunning)(...) is not a function

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:130:21
   if (!stores || stores.length === 0) {
     return computed(() => runningEffects().some(x => x[1] === effect));
   } else {
-    return computed(() =>
-      runningEffects()
-        .filter(runningEffect => runningEffect[1] === effect)
-        .some(runningEffect => {
-          const affectedStore = runningEffect[0].deref();
-          return affectedStore && stores.some(store => store === affectedStore);
-        })
+    return computed(() => undefined
     );
   }
killedBy: isEffectRunning should be false if effect is not running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] MethodExpression
src/lib/store-plugin-status/plugin-status.ts:131:7
     return computed(() => runningEffects().some(x => x[1] === effect));
   } else {
     return computed(() =>
-      runningEffects()
-        .filter(runningEffect => runningEffect[1] === effect)
-        .some(runningEffect => {
-          const affectedStore = runningEffect[0].deref();
-          return affectedStore && stores.some(store => store === affectedStore);
-        })
+      runningEffects().filter(runningEffect => runningEffect[1] === effect).every(runningEffect => {
+  const affectedStore = runningEffect[0].deref();
+  return affectedStore && stores.some(store => store === affectedStore);
+})
     );
   }
killedBy: isEffectRunning should be false if effect is not running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/lib/store-plugin-status/plugin-status.ts:131:7
     return computed(() => runningEffects().some(x => x[1] === effect));
   } else {
     return computed(() =>
-      runningEffects()
-        .filter(runningEffect => runningEffect[1] === effect)
+      runningEffects()
         .some(runningEffect => {
           const affectedStore = runningEffect[0].deref();
killedBy: isEffectRunning should be false if effect is not running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:132:34
   } else {
     return computed(() =>
       runningEffects()
-        .filter(runningEffect => runningEffect[1] === effect)
+        .filter(runningEffect => false)
         .some(runningEffect => {
           const affectedStore = runningEffect[0].deref();
killedBy: isEffectRunning should be true for a running effect and the corresponding store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/lib/store-plugin-status/plugin-status.ts:132:34
   } else {
     return computed(() =>
       runningEffects()
-        .filter(runningEffect => runningEffect[1] === effect)
+        .filter(runningEffect => runningEffect[1] !== effect)
         .some(runningEffect => {
           const affectedStore = runningEffect[0].deref();
killedBy: isEffectRunning should be false if effect is not running
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:133:32
     return computed(() =>
       runningEffects()
         .filter(runningEffect => runningEffect[1] === effect)
-        .some(runningEffect => {
-          const affectedStore = runningEffect[0].deref();
-          return affectedStore && stores.some(store => store === affectedStore);
-        })
+        .some(runningEffect => {})
     );
   }
killedBy: isEffectRunning should be true for a running effect and the corresponding store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
