[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:135:56
         .filter(runningEffect => runningEffect[1] === effect)
         .some(runningEffect => {
           const affectedStore = runningEffect[0].deref();
-          return affectedStore && stores.some(store => store === affectedStore);
+          return affectedStore && stores.some(store => false);
         })
     );
killedBy: isEffectRunning should be true for a running effect and the corresponding store
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:145:47
  * Enables StorePlugin that tracks the loading and modification status of a store.
  * @returns A StorePlugin instance for loading and modification status tracking.
  */
-export function useStoreStatus(): StorePlugin {
-  return {
-    init(store) {
-      isStoreModifiedMap.set(store, signal(false));
-    },
-    postprocessCommand(store) {
-      isStoreModifiedMap.get(store)?.set(true);
-    },
-    preprocessEffect(store, effect) {
-      runningEffects.update(effects => [
-        ...effects,
-        [new WeakRef(store), effect],
-      ]);
-    },
-    postprocessEffect(store, effect, result) {
-      return withSideEffect(result, () => {
-        runningEffects.update(effects => effects.filter(x => x[1] !== effect));
-        if (effect.config.setUnmodifiedStatus) {
-          isStoreModifiedMap.get(store)?.set(false);
-        }
-      });
-    },
-  };
-}
+export function useStoreStatus(): StorePlugin {}
 
killedBy: StoreStatusPlugin should be created using plugin factory method
statusReason: TypeError: Cannot read properties of undefined (reading 'init')

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:147:17
  */
 export function useStoreStatus(): StorePlugin {
   return {
-    init(store) {
-      isStoreModifiedMap.set(store, signal(false));
-    },
+    init(store) {},
     postprocessCommand(store) {
       isStoreModifiedMap.get(store)?.set(true);
killedBy: isModified should be unmodified initially
statusReason: Error: StatusPlugin has not been activated for store Store

[Killed] BooleanLiteral
src/lib/store-plugin-status/plugin-status.ts:148:44
 export function useStoreStatus(): StorePlugin {
   return {
     init(store) {
-      isStoreModifiedMap.set(store, signal(false));
+      isStoreModifiedMap.set(store, signal(true));
     },
     postprocessCommand(store) {
killedBy: isModified should be unmodified initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:150:31
     init(store) {
       isStoreModifiedMap.set(store, signal(false));
     },
-    postprocessCommand(store) {
-      isStoreModifiedMap.get(store)?.set(true);
-    },
+    postprocessCommand(store) {},
     preprocessEffect(store, effect) {
       runningEffects.update(effects => [
killedBy: isModified should mark the store as modified after a command is processed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/lib/store-plugin-status/plugin-status.ts:151:42
       isStoreModifiedMap.set(store, signal(false));
     },
     postprocessCommand(store) {
-      isStoreModifiedMap.get(store)?.set(true);
+      isStoreModifiedMap.get(store)?.set(false);
     },
     preprocessEffect(store, effect) {
killedBy: isModified should mark the store as modified after a command is processed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] OptionalChaining
src/lib/store-plugin-status/plugin-status.ts:151:7
       isStoreModifiedMap.set(store, signal(false));
     },
     postprocessCommand(store) {
-      isStoreModifiedMap.get(store)?.set(true);
+      isStoreModifiedMap.get(store).set(true);
     },
     preprocessEffect(store, effect) {

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:153:37
     postprocessCommand(store) {
       isStoreModifiedMap.get(store)?.set(true);
     },
-    preprocessEffect(store, effect) {
-      runningEffects.update(effects => [
-        ...effects,
-        [new WeakRef(store), effect],
-      ]);
-    },
+    preprocessEffect(store, effect) {},
     postprocessEffect(store, effect, result) {
       return withSideEffect(result, () => {
killedBy: StoreStatusPlugin Running effect should register observable efffect while it runs
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:154:29
       isStoreModifiedMap.get(store)?.set(true);
     },
     preprocessEffect(store, effect) {
-      runningEffects.update(effects => [
-        ...effects,
-        [new WeakRef(store), effect],
-      ]);
+      runningEffects.update(() => undefined);
     },
     postprocessEffect(store, effect, result) {
killedBy: StoreStatusPlugin Running effect should register observable efffect while it runs
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:159:46
         [new WeakRef(store), effect],
       ]);
     },
-    postprocessEffect(store, effect, result) {
-      return withSideEffect(result, () => {
-        runningEffects.update(effects => effects.filter(x => x[1] !== effect));
-        if (effect.config.setUnmodifiedStatus) {
-          isStoreModifiedMap.get(store)?.set(false);
-        }
-      });
-    },
+    postprocessEffect(store, effect, result) {},
   };
 }
killedBy: StoreStatusPlugin Running effect should register observable efffect while it runs
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [[{}, {"config": {"setLoadingStatus": false, "setUnmodifiedStatus": false, "withInjectionContext": true}, "func": [Function anonymous], "name": "dummyEffect"}]]

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:160:43
       ]);
     },
     postprocessEffect(store, effect, result) {
-      return withSideEffect(result, () => {
-        runningEffects.update(effects => effects.filter(x => x[1] !== effect));
-        if (effect.config.setUnmodifiedStatus) {
-          isStoreModifiedMap.get(store)?.set(false);
-        }
-      });
+      return withSideEffect(result, () => {});
     },
   };
killedBy: StoreStatusPlugin Running effect should register observable efffect while it runs
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [[{}, {"config": {"setLoadingStatus": false, "setUnmodifiedStatus": false, "withInjectionContext": true}, "func": [Function anonymous], "name": "dummyEffect"}]]

[Killed] ArrowFunction
src/lib/store-plugin-status/plugin-status.ts:161:31
     },
     postprocessEffect(store, effect, result) {
       return withSideEffect(result, () => {
-        runningEffects.update(effects => effects.filter(x => x[1] !== effect));
+        runningEffects.update(() => undefined);
         if (effect.config.setUnmodifiedStatus) {
           isStoreModifiedMap.get(store)?.set(false);
killedBy: StoreStatusPlugin Running effect should register observable efffect while it runs
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:161:62
     },
     postprocessEffect(store, effect, result) {
       return withSideEffect(result, () => {
-        runningEffects.update(effects => effects.filter(x => x[1] !== effect));
+        runningEffects.update(effects => effects.filter(x => true));
         if (effect.config.setUnmodifiedStatus) {
           isStoreModifiedMap.get(store)?.set(false);
killedBy: StoreStatusPlugin Running effect should register observable efffect while it runs
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [[{}, {"config": {"setLoadingStatus": false, "setUnmodifiedStatus": false, "withInjectionContext": true}, "func": [Function anonymous], "name": "dummyEffect"}]]

[Killed] BlockStatement
src/lib/store-plugin-status/plugin-status.ts:162:48
     postprocessEffect(store, effect, result) {
       return withSideEffect(result, () => {
         runningEffects.update(effects => effects.filter(x => x[1] !== effect));
-        if (effect.config.setUnmodifiedStatus) {
-          isStoreModifiedMap.get(store)?.set(false);
-        }
+        if (effect.config.setUnmodifiedStatus) {}
       });
     },
killedBy: isModified should mark the store as unmodified after an effect with setUnmodifiedStatus is processed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/store-plugin-status/plugin-status.ts:162:13
     postprocessEffect(store, effect, result) {
       return withSideEffect(result, () => {
         runningEffects.update(effects => effects.filter(x => x[1] !== effect));
-        if (effect.config.setUnmodifiedStatus) {
+        if (false) {
           isStoreModifiedMap.get(store)?.set(false);
         }
killedBy: isModified should mark the store as unmodified after an effect with setUnmodifiedStatus is processed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/lib/store-plugin-status/plugin-status.ts:163:46
       return withSideEffect(result, () => {
         runningEffects.update(effects => effects.filter(x => x[1] !== effect));
         if (effect.config.setUnmodifiedStatus) {
-          isStoreModifiedMap.get(store)?.set(false);
+          isStoreModifiedMap.get(store)?.set(true);
         }
       });
killedBy: isModified should mark the store as unmodified after an effect with setUnmodifiedStatus is processed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] OptionalChaining
src/lib/store-plugin-status/plugin-status.ts:163:11
       return withSideEffect(result, () => {
         runningEffects.update(effects => effects.filter(x => x[1] !== effect));
         if (effect.config.setUnmodifiedStatus) {
-          isStoreModifiedMap.get(store)?.set(false);
+          isStoreModifiedMap.get(store).set(false);
         }
       });
