[Survived] LogicalOperator
signalstory/src/lib/store.ts:51:13
    */
   public constructor(config: StoreConfig<TState>) {
     this.config = {
-      name: config.name ?? this.constructor.name,
+      name: config.name && this.constructor.name,
       initialState: config.initialState,
       injector: config.injector ?? getInjectorOrNull(),

[Killed] LogicalOperator
signalstory/src/lib/store.ts:53:17
     this.config = {
       name: config.name ?? this.constructor.name,
       initialState: config.initialState,
-      injector: config.injector ?? getInjectorOrNull(),
+      injector: config.injector && getInjectorOrNull(),
       stateEqualityFn: config.stateEqualityFn ?? null,
       enableLogging: config.enableLogging ?? false,
killedBy: runEffect should runEffect in injection context by default
statusReason: Error: NG0203: inject() must be called from an injection context such as a constructor, a factory function, a field initializer, or a function used with `runInInjectionContext`. Find more at https://angular.io/errors/NG0203

[Survived] LogicalOperator
signalstory/src/lib/store.ts:54:24
       name: config.name ?? this.constructor.name,
       initialState: config.initialState,
       injector: config.injector ?? getInjectorOrNull(),
-      stateEqualityFn: config.stateEqualityFn ?? null,
+      stateEqualityFn: config.stateEqualityFn && null,
       enableLogging: config.enableLogging ?? false,
       plugins: config.plugins ?? [],

[Killed] BooleanLiteral
signalstory/src/lib/store.ts:55:46
       initialState: config.initialState,
       injector: config.injector ?? getInjectorOrNull(),
       stateEqualityFn: config.stateEqualityFn ?? null,
-      enableLogging: config.enableLogging ?? false,
+      enableLogging: config.enableLogging ?? true,
       plugins: config.plugins ?? [],
     };
killedBy: StoreStatusPlugin should be created using plugin factory method
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [[Function init], [Function anonymous]]

[Survived] LogicalOperator
signalstory/src/lib/store.ts:55:22
       initialState: config.initialState,
       injector: config.injector ?? getInjectorOrNull(),
       stateEqualityFn: config.stateEqualityFn ?? null,
-      enableLogging: config.enableLogging ?? false,
+      enableLogging: config.enableLogging && false,
       plugins: config.plugins ?? [],
     };

[Killed] LogicalOperator
signalstory/src/lib/store.ts:56:16
       injector: config.injector ?? getInjectorOrNull(),
       stateEqualityFn: config.stateEqualityFn ?? null,
       enableLogging: config.enableLogging ?? false,
-      plugins: config.plugins ?? [],
+      plugins: config.plugins && [],
     };
 
killedBy: register should register an event handler in the MediatorRegistry
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')

[Survived] LogicalOperator
signalstory/src/lib/store.ts:60:14
     };
 
     this._state = signal(this.config.initialState, {
-      equal: this.config.stateEqualityFn ?? undefined,
+      equal: this.config.stateEqualityFn && undefined,
     });
 

[Killed] ConditionalExpression
signalstory/src/lib/store.ts:65:7
 
     //TODO: Remove as soon as enableLogging removed due to deprecation
     if (
-      this.config.enableLogging &&
-      !this.config.plugins.some(x => 'name' in x && x['name'] === 'StoreLogger')
+      true
     ) {
       this.config.plugins.push(useLogger());
killedBy: StorePlugin should not add processors to store if not used
statusReason: Error: expect(received).toBeUndefined()

Received: [[Function anonymous]]

[Killed] LogicalOperator
signalstory/src/lib/store.ts:65:7
 
     //TODO: Remove as soon as enableLogging removed due to deprecation
     if (
-      this.config.enableLogging &&
-      !this.config.plugins.some(x => 'name' in x && x['name'] === 'StoreLogger')
+      this.config.enableLogging || !this.config.plugins.some(x => 'name' in x && x['name'] === 'StoreLogger')
     ) {
       this.config.plugins.push(useLogger());
killedBy: StoreStatusPlugin should be created using plugin factory method
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [[Function init], [Function anonymous]]

[NoCoverage] LogicalOperator
signalstory/src/lib/store.ts:66:38
     //TODO: Remove as soon as enableLogging removed due to deprecation
     if (
       this.config.enableLogging &&
-      !this.config.plugins.some(x => 'name' in x && x['name'] === 'StoreLogger')
+      !this.config.plugins.some(x => 'name' in x || x['name'] === 'StoreLogger')
     ) {
       this.config.plugins.push(useLogger());

[NoCoverage] ConditionalExpression
signalstory/src/lib/store.ts:66:53
     //TODO: Remove as soon as enableLogging removed due to deprecation
     if (
       this.config.enableLogging &&
-      !this.config.plugins.some(x => 'name' in x && x['name'] === 'StoreLogger')
+      !this.config.plugins.some(x => 'name' in x && true)
     ) {
       this.config.plugins.push(useLogger());

[NoCoverage] BlockStatement
signalstory/src/lib/store.ts:67:7
     if (
       this.config.enableLogging &&
       !this.config.plugins.some(x => 'name' in x && x['name'] === 'StoreLogger')
-    ) {
-      this.config.plugins.push(useLogger());
-    }
+    ) {}
 
     this.config.plugins

[Killed] MethodExpression
signalstory/src/lib/store.ts:71:5
       this.config.plugins.push(useLogger());
     }
 
-    this.config.plugins
-      .sort((a, b) => (b.precedence ?? 0) - (a.precedence ?? 0))
+    this.config.plugins
       .forEach(plugin => {
         if (plugin.init) {
killedBy: registration should come first in ordering
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: [Function init]
Received: serializes to the same string

[Killed] LogicalOperator
signalstory/src/lib/store.ts:72:46
     }
 
     this.config.plugins
-      .sort((a, b) => (b.precedence ?? 0) - (a.precedence ?? 0))
+      .sort((a, b) => (b.precedence ?? 0) - (a.precedence && 0))
       .forEach(plugin => {
         if (plugin.init) {
killedBy: registration should come first in ordering
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: [Function init]
Received: serializes to the same string

[Killed] ArrowFunction
signalstory/src/lib/store.ts:72:13
     }
 
     this.config.plugins
-      .sort((a, b) => (b.precedence ?? 0) - (a.precedence ?? 0))
+      .sort(() => undefined)
       .forEach(plugin => {
         if (plugin.init) {
killedBy: registration should come first in ordering
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: [Function init]
Received: serializes to the same string

[Killed] BlockStatement
signalstory/src/lib/store.ts:73:26
 
     this.config.plugins
       .sort((a, b) => (b.precedence ?? 0) - (a.precedence ?? 0))
-      .forEach(plugin => {
-        if (plugin.init) {
-          (this.initPostprocessor as any) ??= [];
-          this.initPostprocessor!.push(plugin.init);
-        }
-        if (plugin.preprocessCommand) {
-          (this.commandPreprocessor as any) ??= [];
-          this.commandPreprocessor!.push(plugin.preprocessCommand);
-        }
-        if (plugin.postprocessCommand) {
-          (this.commandPostprocessor as any) ??= [];
-          this.commandPostprocessor!.push(plugin.postprocessCommand);
-        }
-        if (plugin.preprocessEffect) {
-          (this.effectPreprocessor as any) ??= [];
-          this.effectPreprocessor!.push(plugin.preprocessEffect);
-        }
-        if (plugin.postprocessEffect) {
-          (this.effectPostprocessor as any) ??= [];
-          this.effectPostprocessor!.push(plugin.postprocessEffect);
-        }
-      });
+      .forEach(plugin => {});
 
     this.initPostprocessor?.forEach(p => p(this));
killedBy: automatic sync Should initialize from storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "val": "initialFromStorage",
+   "val": "initial",

[Killed] BlockStatement
signalstory/src/lib/store.ts:74:26
     this.config.plugins
       .sort((a, b) => (b.precedence ?? 0) - (a.precedence ?? 0))
       .forEach(plugin => {
-        if (plugin.init) {
-          (this.initPostprocessor as any) ??= [];
-          this.initPostprocessor!.push(plugin.init);
-        }
+        if (plugin.init) {}
         if (plugin.preprocessCommand) {
           (this.commandPreprocessor as any) ??= [];
killedBy: StoreStatusPlugin should be created using plugin factory method
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
signalstory/src/lib/store.ts:74:13
     this.config.plugins
       .sort((a, b) => (b.precedence ?? 0) - (a.precedence ?? 0))
       .forEach(plugin => {
-        if (plugin.init) {
+        if (true) {
           (this.initPostprocessor as any) ??= [];
           this.initPostprocessor!.push(plugin.init);
killedBy: StorePlugin CommandPreprocessor should preprocess command on set successfully
statusReason: TypeError: p is not a function

[Killed] AssignmentOperator
signalstory/src/lib/store.ts:75:11
       .sort((a, b) => (b.precedence ?? 0) - (a.precedence ?? 0))
       .forEach(plugin => {
         if (plugin.init) {
-          (this.initPostprocessor as any) ??= [];
+          (this.initPostprocessor as any) &&= [];
           this.initPostprocessor!.push(plugin.init);
         }
killedBy: StorePlugin should add processors to store successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
signalstory/src/lib/store.ts:78:13
           (this.initPostprocessor as any) ??= [];
           this.initPostprocessor!.push(plugin.init);
         }
-        if (plugin.preprocessCommand) {
+        if (true) {
           (this.commandPreprocessor as any) ??= [];
           this.commandPreprocessor!.push(plugin.preprocessCommand);
killedBy: StoreStatusPlugin should be created using plugin factory method
statusReason: Error: expect(received).toBeUndefined()

Received: [undefined]

[Killed] ConditionalExpression
signalstory/src/lib/store.ts:78:13
           (this.initPostprocessor as any) ??= [];
           this.initPostprocessor!.push(plugin.init);
         }
-        if (plugin.preprocessCommand) {
+        if (false) {
           (this.commandPreprocessor as any) ??= [];
           this.commandPreprocessor!.push(plugin.preprocessCommand);
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] AssignmentOperator
signalstory/src/lib/store.ts:79:11
           this.initPostprocessor!.push(plugin.init);
         }
         if (plugin.preprocessCommand) {
-          (this.commandPreprocessor as any) ??= [];
+          (this.commandPreprocessor as any) &&= [];
           this.commandPreprocessor!.push(plugin.preprocessCommand);
         }
killedBy: addToHistory with mutable store should clone and add an item to history if history is enabled
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
signalstory/src/lib/store.ts:82:40
           (this.commandPreprocessor as any) ??= [];
           this.commandPreprocessor!.push(plugin.preprocessCommand);
         }
-        if (plugin.postprocessCommand) {
-          (this.commandPostprocessor as any) ??= [];
-          this.commandPostprocessor!.push(plugin.postprocessCommand);
-        }
+        if (plugin.postprocessCommand) {}
         if (plugin.preprocessEffect) {
           (this.effectPreprocessor as any) ??= [];
killedBy: StoreStatusPlugin should be created using plugin factory method
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
signalstory/src/lib/store.ts:82:13
           (this.commandPreprocessor as any) ??= [];
           this.commandPreprocessor!.push(plugin.preprocessCommand);
         }
-        if (plugin.postprocessCommand) {
+        if (true) {
           (this.commandPostprocessor as any) ??= [];
           this.commandPostprocessor!.push(plugin.postprocessCommand);
killedBy: StorePlugin CommandPreprocessor should preprocess command on set successfully
statusReason: TypeError: p is not a function

[Killed] AssignmentOperator
signalstory/src/lib/store.ts:83:11
           this.commandPreprocessor!.push(plugin.preprocessCommand);
         }
         if (plugin.postprocessCommand) {
-          (this.commandPostprocessor as any) ??= [];
+          (this.commandPostprocessor as any) &&= [];
           this.commandPostprocessor!.push(plugin.postprocessCommand);
         }
killedBy: StorePlugin should add processors to store successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
signalstory/src/lib/store.ts:86:38
           (this.commandPostprocessor as any) ??= [];
           this.commandPostprocessor!.push(plugin.postprocessCommand);
         }
-        if (plugin.preprocessEffect) {
-          (this.effectPreprocessor as any) ??= [];
-          this.effectPreprocessor!.push(plugin.preprocessEffect);
-        }
+        if (plugin.preprocessEffect) {}
         if (plugin.postprocessEffect) {
           (this.effectPostprocessor as any) ??= [];
killedBy: StoreStatusPlugin should be created using plugin factory method
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
signalstory/src/lib/store.ts:86:13
           (this.commandPostprocessor as any) ??= [];
           this.commandPostprocessor!.push(plugin.postprocessCommand);
         }
-        if (plugin.preprocessEffect) {
+        if (true) {
           (this.effectPreprocessor as any) ??= [];
           this.effectPreprocessor!.push(plugin.preprocessEffect);
killedBy: StorePlugin EffectPostprocessor should postprocess normal effect successfully
statusReason: TypeError: p is not a function

[Killed] AssignmentOperator
signalstory/src/lib/store.ts:87:11
           this.commandPostprocessor!.push(plugin.postprocessCommand);
         }
         if (plugin.preprocessEffect) {
-          (this.effectPreprocessor as any) ??= [];
+          (this.effectPreprocessor as any) &&= [];
           this.effectPreprocessor!.push(plugin.preprocessEffect);
         }
killedBy: StorePlugin should add processors to store successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
signalstory/src/lib/store.ts:90:39
           (this.effectPreprocessor as any) ??= [];
           this.effectPreprocessor!.push(plugin.preprocessEffect);
         }
-        if (plugin.postprocessEffect) {
-          (this.effectPostprocessor as any) ??= [];
-          this.effectPostprocessor!.push(plugin.postprocessEffect);
-        }
+        if (plugin.postprocessEffect) {}
       });
 
killedBy: StoreStatusPlugin should be created using plugin factory method
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
signalstory/src/lib/store.ts:90:13
           (this.effectPreprocessor as any) ??= [];
           this.effectPreprocessor!.push(plugin.preprocessEffect);
         }
-        if (plugin.postprocessEffect) {
+        if (true) {
           (this.effectPostprocessor as any) ??= [];
           this.effectPostprocessor!.push(plugin.postprocessEffect);
killedBy: StorePlugin EffectPreprocessor should preprocess effect successfully
statusReason: TypeError: postprocessor is not a function

[Killed] AssignmentOperator
signalstory/src/lib/store.ts:91:11
           this.effectPreprocessor!.push(plugin.preprocessEffect);
         }
         if (plugin.postprocessEffect) {
-          (this.effectPostprocessor as any) ??= [];
+          (this.effectPostprocessor as any) &&= [];
           this.effectPostprocessor!.push(plugin.postprocessEffect);
         }
killedBy: StoreStatusPlugin should be created using plugin factory method
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrowFunction
signalstory/src/lib/store.ts:96:37
         }
       });
 
-    this.initPostprocessor?.forEach(p => p(this));
+    this.initPostprocessor?.forEach(() => undefined);
   }
 
killedBy: automatic sync Should initialize from storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "val": "initialFromStorage",
+   "val": "initial",

[Killed] OptionalChaining
signalstory/src/lib/store.ts:96:5
         }
       });
 
-    this.initPostprocessor?.forEach(p => p(this));
+    this.initPostprocessor.forEach(p => p(this));
   }
 
killedBy: DeepFreeze plugin should deep freeze after set without creating new object
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Survived] BlockStatement
signalstory/src/lib/store.ts:102:29
   /**
    * Gets the name of the store
    */
-  public get name(): string {
-    return this.config.name;
-  }
+  public get name(): string {}
 
   /**

[Killed] BlockStatement
signalstory/src/lib/store.ts:109:38
   /**
    * Gets the signal representing the store's current state.
    */
-  public get state(): Signal<TState> {
-    return this._state.asReadonly();
-  }
+  public get state(): Signal<TState> {}
 
   /**
killedBy: StorePlugin CommandPreprocessor should preprocess command on set successfully
statusReason: TypeError: store.state is not a function

[Killed] BlockStatement
signalstory/src/lib/store.ts:118:60
    * @param newState The new state of the store.
    * @param commandName The name of the command associated with the state change.
    */
-  public set(newState: TState, commandName?: string): void {
-    this.commandPreprocessor?.forEach(p => p(this, commandName));
-
-    this._state.set(newState);
-
-    this.commandPostprocessor?.forEach(p => p(this, commandName));
-  }
+  public set(newState: TState, commandName?: string): void {}
 
   /**
killedBy: StorePlugin CommandPreprocessor should preprocess command on set successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] OptionalChaining
signalstory/src/lib/store.ts:119:5
    * @param commandName The name of the command associated with the state change.
    */
   public set(newState: TState, commandName?: string): void {
-    this.commandPreprocessor?.forEach(p => p(this, commandName));
+    this.commandPreprocessor.forEach(p => p(this, commandName));
 
     this._state.set(newState);
killedBy: isModified should mark the store as modified after a command is processed
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ArrowFunction
signalstory/src/lib/store.ts:119:39
    * @param commandName The name of the command associated with the state change.
    */
   public set(newState: TState, commandName?: string): void {
-    this.commandPreprocessor?.forEach(p => p(this, commandName));
+    this.commandPreprocessor?.forEach(() => undefined);
 
     this._state.set(newState);
killedBy: StorePlugin CommandPreprocessor should preprocess command on set successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] OptionalChaining
signalstory/src/lib/store.ts:123:5
 
     this._state.set(newState);
 
-    this.commandPostprocessor?.forEach(p => p(this, commandName));
+    this.commandPostprocessor.forEach(p => p(this, commandName));
   }
 
killedBy: StorePlugin CommandPreprocessor should preprocess command on set successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ArrowFunction
signalstory/src/lib/store.ts:123:40
 
     this._state.set(newState);
 
-    this.commandPostprocessor?.forEach(p => p(this, commandName));
+    this.commandPostprocessor?.forEach(() => undefined);
   }
 
killedBy: isModified should mark the store as modified after a command is processed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
signalstory/src/lib/store.ts:134:11
   public update(
     updateFn: (currentState: TState) => TState,
     commandName?: string
-  ): void {
-    this.commandPreprocessor?.forEach(p => p(this, commandName));
-
-    this._state.update(state => updateFn(state));
-
-    this.commandPostprocessor?.forEach(p => p(this, commandName));
-  }
+  ): void {}
 
   /**
killedBy: update should update object store with the provided new state and notify consumers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 5,

[Killed] OptionalChaining
signalstory/src/lib/store.ts:135:5
     updateFn: (currentState: TState) => TState,
     commandName?: string
   ): void {
-    this.commandPreprocessor?.forEach(p => p(this, commandName));
+    this.commandPreprocessor.forEach(p => p(this, commandName));
 
     this._state.update(state => updateFn(state));
killedBy: StorePlugin CommandPostprocessor should post-process command on update successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ArrowFunction
signalstory/src/lib/store.ts:135:39
     updateFn: (currentState: TState) => TState,
     commandName?: string
   ): void {
-    this.commandPreprocessor?.forEach(p => p(this, commandName));
+    this.commandPreprocessor?.forEach(() => undefined);
 
     this._state.update(state => updateFn(state));
killedBy: StorePlugin CommandPreprocessor should preprocess command on update successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
signalstory/src/lib/store.ts:137:24
   ): void {
     this.commandPreprocessor?.forEach(p => p(this, commandName));
 
-    this._state.update(state => updateFn(state));
+    this._state.update(() => undefined);
 
     this.commandPostprocessor?.forEach(p => p(this, commandName));
killedBy: StorePlugin CommandPostprocessor should post-process command on update successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
signalstory/src/lib/store.ts:150:11
   public mutate(
     mutator: (currentState: TState) => void,
     commandName?: string
-  ): void {
-    this.commandPreprocessor?.forEach(p => p(this, commandName));
-
-    this._state.update(state => {
-      const cloned = shallowClone(state);
-      mutator(cloned);
-      return cloned;
-    });
-
-    this.commandPostprocessor?.forEach(p => p(this, commandName));
-  }
+  ): void {}
 
   public myFunc(myNumber: number) {
killedBy: mutate should update store with the provided mutation function and trigger changed event notification
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not {"value": 5}

[Killed] BlockStatement
signalstory/src/lib/store.ts:153:33
   ): void {
     this.commandPreprocessor?.forEach(p => p(this, commandName));
 
-    this._state.update(state => {
-      const cloned = shallowClone(state);
-      mutator(cloned);
-      return cloned;
-    });
+    this._state.update(state => {});
 
     this.commandPostprocessor?.forEach(p => p(this, commandName));
killedBy: StorePlugin CommandPostprocessor should post-process command on mutate successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[NoCoverage] BlockStatement
signalstory/src/lib/store.ts:162:35
     this.commandPostprocessor?.forEach(p => p(this, commandName));
   }
 
-  public myFunc(myNumber: number) {
-    const a = 3;
-    return myNumber + a + 10;
-  }
+  public myFunc(myNumber: number) {}
 
   /**

[NoCoverage] ArithmeticOperator
signalstory/src/lib/store.ts:164:12
 
   public myFunc(myNumber: number) {
     const a = 3;
-    return myNumber + a + 10;
+    return myNumber - a + 10;
   }
 

[NoCoverage] ArithmeticOperator
signalstory/src/lib/store.ts:164:12
 
   public myFunc(myNumber: number) {
     const a = 3;
-    return myNumber + a + 10;
+    return myNumber + a - 10;
   }
 

[Killed] BlockStatement
signalstory/src/lib/store.ts:175:5
   public registerHandler<TPayload>(
     event: StoreEvent<TPayload>,
     handler: (store: this, event: StoreEvent<TPayload>) => void
-  ) {
-    register(rootRegistry, this, event, handler);
-  }
+  ) {}
 
   /**
killedBy: registerHandler should register Handler in rootRegistry
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
signalstory/src/lib/store.ts:188:64
     event: StoreEvent<any>,
     ...events: StoreEvent<any>[]
   ): void;
-  public unregisterHandler(...events: StoreEvent<any>[]): void {
-    unregister(rootRegistry, this, ...events);
-  }
+  public unregisterHandler(...events: StoreEvent<any>[]): void {}
 
   /**
killedBy: unregisterHandler should unregister existing Handler in rootRegistry
statusReason: Error: expect(received).toBeUndefined()

Received: Set {{"handler": [Function anonymous], "store": {}}}

[Killed] BlockStatement
signalstory/src/lib/store.ts:205:14
   public runEffect<TArgs extends any[], TResult>(
     effect: StoreEffect<this, TArgs, TResult>,
     ...args: TArgs
-  ): TResult {
-    this.effectPreprocessor?.forEach(p => p(this, effect));
-
-    const effectResult =
-      effect.config.withInjectionContext && this.config.injector
-        ? runInInjectionContext(this.config.injector, () =>
-            effect.func(this, ...args)
-          )
-        : effect.func(this, ...args);
-
-    return (
-      this.effectPostprocessor?.reduce(
-        (acc, postprocessor) => postprocessor(this, effect, acc) as TResult,
-        effectResult
-      ) ?? effectResult
-    );
-  }
+  ): TResult {}
 
   /**
killedBy: StorePlugin EffectPreprocessor should preprocess effect successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] OptionalChaining
signalstory/src/lib/store.ts:206:5
     effect: StoreEffect<this, TArgs, TResult>,
     ...args: TArgs
   ): TResult {
-    this.effectPreprocessor?.forEach(p => p(this, effect));
+    this.effectPreprocessor.forEach(p => p(this, effect));
 
     const effectResult =
killedBy: StorePlugin EffectPostprocessor should postprocess normal effect successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ArrowFunction
signalstory/src/lib/store.ts:206:38
     effect: StoreEffect<this, TArgs, TResult>,
     ...args: TArgs
   ): TResult {
-    this.effectPreprocessor?.forEach(p => p(this, effect));
+    this.effectPreprocessor?.forEach(() => undefined);
 
     const effectResult =
killedBy: StorePlugin EffectPreprocessor should preprocess effect successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
signalstory/src/lib/store.ts:209:7
     this.effectPreprocessor?.forEach(p => p(this, effect));
 
     const effectResult =
-      effect.config.withInjectionContext && this.config.injector
+      false
         ? runInInjectionContext(this.config.injector, () =>
             effect.func(this, ...args)
killedBy: runEffect should runEffect in injection context by default
statusReason: Error: NG0203: inject() must be called from an injection context such as a constructor, a factory function, a field initializer, or a function used with `runInInjectionContext`. Find more at https://angular.io/errors/NG0203

[Survived] ConditionalExpression
signalstory/src/lib/store.ts:209:7
     this.effectPreprocessor?.forEach(p => p(this, effect));
 
     const effectResult =
-      effect.config.withInjectionContext && this.config.injector
+      true
         ? runInInjectionContext(this.config.injector, () =>
             effect.func(this, ...args)

[Timeout] ArrowFunction
signalstory/src/lib/store.ts:210:55
 
     const effectResult =
       effect.config.withInjectionContext && this.config.injector
-        ? runInInjectionContext(this.config.injector, () =>
-            effect.func(this, ...args)
+        ? runInInjectionContext(this.config.injector, () => undefined
           )
         : effect.func(this, ...args);

[Killed] LogicalOperator
signalstory/src/lib/store.ts:216:7
         : effect.func(this, ...args);
 
     return (
-      this.effectPostprocessor?.reduce(
-        (acc, postprocessor) => postprocessor(this, effect, acc) as TResult,
-        effectResult
-      ) ?? effectResult
+      this.effectPostprocessor?.reduce((acc, postprocessor) => (postprocessor(this, effect, acc) as TResult), effectResult) && effectResult
     );
   }
killedBy: StorePlugin EffectPostprocessor should postprocess observable effect successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined
