[Killed] OptionalChaining
signalstory/src/lib/store.ts:216:7
         : effect.func(this, ...args);
 
     return (
-      this.effectPostprocessor?.reduce(
+      this.effectPostprocessor.reduce(
         (acc, postprocessor) => postprocessor(this, effect, acc) as TResult,
         effectResult
killedBy: StorePlugin EffectPreprocessor should preprocess effect successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'reduce')

[Killed] ArrowFunction
signalstory/src/lib/store.ts:217:9
 
     return (
       this.effectPostprocessor?.reduce(
-        (acc, postprocessor) => postprocessor(this, effect, acc) as TResult,
+        () => undefined,
         effectResult
       ) ?? effectResult
killedBy: StorePlugin EffectPostprocessor should postprocess normal effect successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
signalstory/src/lib/store.ts:239:22
   >(
     storeQuery: StoreQuery<TResult, TStores, TArgs>,
     ...args: TArgs extends undefined ? [] : [TArgs]
-  ): Signal<TResult> {
-    if (!this.config.injector) {
-      assertInInjectionContext(this.runQuery);
-    }
-
-    return runInInjectionContext(
-      this.config.injector ?? inject(Injector),
-      () => {
-        const queryArgs = [
-          ...(storeQuery.stores.map(x =>
-            x === this.constructor ? this : inject(x)
-          ) as {
-            [K in keyof TStores]: TStores[K] extends ProviderToken<infer U>
-              ? U
-              : never;
-          }),
-          ...(args as any[]),
-        ];
-
-        return computed(() => storeQuery.query(...(queryArgs as any)));
-      }
-    );
-  }
+  ): Signal<TResult> {}
 }
 
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: TypeError: store.runQuery(...) is not a function

[Killed] BooleanLiteral
signalstory/src/lib/store.ts:240:9
     storeQuery: StoreQuery<TResult, TStores, TArgs>,
     ...args: TArgs extends undefined ? [] : [TArgs]
   ): Signal<TResult> {
-    if (!this.config.injector) {
+    if (this.config.injector) {
       assertInInjectionContext(this.runQuery);
     }
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: Error: NG0203: runQuery() can only be used within an injection context such as a constructor, a factory function, a field initializer, or a function used with `runInInjectionContext`. Find more at https://angular.io/errors/NG0203

[Killed] ConditionalExpression
signalstory/src/lib/store.ts:240:9
     storeQuery: StoreQuery<TResult, TStores, TArgs>,
     ...args: TArgs extends undefined ? [] : [TArgs]
   ): Signal<TResult> {
-    if (!this.config.injector) {
+    if (true) {
       assertInInjectionContext(this.runQuery);
     }
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: Error: NG0203: runQuery() can only be used within an injection context such as a constructor, a factory function, a field initializer, or a function used with `runInInjectionContext`. Find more at https://angular.io/errors/NG0203

[Killed] LogicalOperator
signalstory/src/lib/store.ts:245:7
     }
 
     return runInInjectionContext(
-      this.config.injector ?? inject(Injector),
+      this.config.injector && inject(Injector),
       () => {
         const queryArgs = [
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: Error: NG0203: inject() must be called from an injection context such as a constructor, a factory function, a field initializer, or a function used with `runInInjectionContext`. Find more at https://angular.io/errors/NG0203

[Killed] BlockStatement
signalstory/src/lib/store.ts:246:13
 
     return runInInjectionContext(
       this.config.injector ?? inject(Injector),
-      () => {
-        const queryArgs = [
-          ...(storeQuery.stores.map(x =>
-            x === this.constructor ? this : inject(x)
-          ) as {
-            [K in keyof TStores]: TStores[K] extends ProviderToken<infer U>
-              ? U
-              : never;
-          }),
-          ...(args as any[]),
-        ];
-
-        return computed(() => storeQuery.query(...(queryArgs as any)));
-      }
+      () => {}
     );
   }
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: TypeError: store.runQuery(...) is not a function

[Killed] ArrayDeclaration
signalstory/src/lib/store.ts:247:27
     return runInInjectionContext(
       this.config.injector ?? inject(Injector),
       () => {
-        const queryArgs = [
-          ...(storeQuery.stores.map(x =>
-            x === this.constructor ? this : inject(x)
-          ) as {
-            [K in keyof TStores]: TStores[K] extends ProviderToken<infer U>
-              ? U
-              : never;
-          }),
-          ...(args as any[]),
-        ];
+        const queryArgs = [];
 
         return computed(() => storeQuery.query(...(queryArgs as any)));
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: TypeError: Cannot read properties of undefined (reading 'state')

[Killed] ArrowFunction
signalstory/src/lib/store.ts:258:25
           ...(args as any[]),
         ];
 
-        return computed(() => storeQuery.query(...(queryArgs as any)));
+        return computed(() => undefined);
       }
     );
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"value": 10}
Received: undefined
