[Killed] BlockStatement
src/lib/store-immutability/immutable-store.ts:17:60
     mutation: (draftState: TState) => void
   ) => TState;
 
-  public constructor(config: ImmutableStoreConfig<TState>) {
-    super(config);
-
-    this.cloneAndMutateFunc =
-      config.mutationProducerFn ?? naiveCloneAndMutateFunc;
-  }
+  public constructor(config: ImmutableStoreConfig<TState>) {}
 
   /**
killedBy: addToHistory with immutable store should add an item to history if history is enabled without cloning
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] LogicalOperator
src/lib/store-immutability/immutable-store.ts:21:7
     super(config);
 
     this.cloneAndMutateFunc =
-      config.mutationProducerFn ?? naiveCloneAndMutateFunc;
+      config.mutationProducerFn && naiveCloneAndMutateFunc;
   }
 
killedBy: mutate should update store with the provided mutation function creating a new instance
statusReason: TypeError: this.cloneAndMutateFunc is not a function

[Killed] BlockStatement
src/lib/store-immutability/immutable-store.ts:42:11
       | ((currentState: TState) => void)
       | ((currentState: Immutable<TState>) => void),
     commandName?: string
-  ): void {
-    this.update(
-      state =>
-        this.cloneAndMutateFunc(
-          state as TState,
-          mutator as (currentState: TState) => void
-        ) as Immutable<TState>,
-      commandName
-    );
-  }
+  ): void {}
 }
 
killedBy: mutate should update store with the provided mutation function creating a new instance
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not {"value1": 5, "value2": "test"}

[Killed] ArrowFunction
src/lib/store-immutability/immutable-store.ts:44:7
     commandName?: string
   ): void {
     this.update(
-      state =>
-        this.cloneAndMutateFunc(
-          state as TState,
-          mutator as (currentState: TState) => void
-        ) as Immutable<TState>,
+      () => undefined,
       commandName
     );
killedBy: mutate should update store with the provided mutation function creating a new instance
statusReason: TypeError: Cannot read properties of undefined (reading 'value1')
