[Killed] BlockStatement
signalstory/src/lib/store-effect.ts:87:40
   name: string,
   func: (store: TStore, ...args: TArgs) => TResult,
   arg?: boolean | StoreEffectConfig
-): StoreEffect<TStore, TArgs, TResult> {
-  return {
-    name,
-    func,
-    config: {
-      withInjectionContext:
-        !arg || arg === true || (arg.withInjectionContext ?? true),
-      setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus ?? false,
-      setUnmodifiedStatus:
-        (arg as StoreEffectConfig)?.setUnmodifiedStatus ?? false,
-    },
-  };
-}
+): StoreEffect<TStore, TArgs, TResult> {}
 
killedBy: runEffect should runEffect without injection context
statusReason: TypeError: Cannot read properties of undefined (reading 'config')

[Killed] ObjectLiteral
signalstory/src/lib/store-effect.ts:91:13
   return {
     name,
     func,
-    config: {
-      withInjectionContext:
-        !arg || arg === true || (arg.withInjectionContext ?? true),
-      setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus ?? false,
-      setUnmodifiedStatus:
-        (arg as StoreEffectConfig)?.setUnmodifiedStatus ?? false,
-    },
+    config: {},
   };
 }
killedBy: isLoading should be true for a running effect that has been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
signalstory/src/lib/store-effect.ts:93:9
     func,
     config: {
       withInjectionContext:
-        !arg || arg === true || (arg.withInjectionContext ?? true),
+        false,
       setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus ?? false,
       setUnmodifiedStatus:
killedBy: runEffect should runEffect in injection context by default
statusReason: Error: NG0203: inject() must be called from an injection context such as a constructor, a factory function, a field initializer, or a function used with `runInInjectionContext`. Find more at https://angular.io/errors/NG0203

[Timeout] EqualityOperator
signalstory/src/lib/store-effect.ts:93:17
     func,
     config: {
       withInjectionContext:
-        !arg || arg === true || (arg.withInjectionContext ?? true),
+        !arg || arg !== true || (arg.withInjectionContext ?? true),
       setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus ?? false,
       setUnmodifiedStatus:

[Killed] BooleanLiteral
signalstory/src/lib/store-effect.ts:94:73
     config: {
       withInjectionContext:
         !arg || arg === true || (arg.withInjectionContext ?? true),
-      setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus ?? false,
+      setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus ?? true,
       setUnmodifiedStatus:
         (arg as StoreEffectConfig)?.setUnmodifiedStatus ?? false,
killedBy: isLoading should be false for a running effect that has not been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
signalstory/src/lib/store-effect.ts:94:25
     config: {
       withInjectionContext:
         !arg || arg === true || (arg.withInjectionContext ?? true),
-      setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus ?? false,
+      setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus && false,
       setUnmodifiedStatus:
         (arg as StoreEffectConfig)?.setUnmodifiedStatus ?? false,
killedBy: isLoading should be true for a running effect that has been created with setLoadingStatus enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
signalstory/src/lib/store-effect.ts:96:9
         !arg || arg === true || (arg.withInjectionContext ?? true),
       setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus ?? false,
       setUnmodifiedStatus:
-        (arg as StoreEffectConfig)?.setUnmodifiedStatus ?? false,
+        (arg as StoreEffectConfig)?.setUnmodifiedStatus && false,
     },
   };
killedBy: isModified should mark the store as unmodified after an effect with setUnmodifiedStatus is processed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
signalstory/src/lib/store-effect.ts:96:60
         !arg || arg === true || (arg.withInjectionContext ?? true),
       setLoadingStatus: (arg as StoreEffectConfig)?.setLoadingStatus ?? false,
       setUnmodifiedStatus:
-        (arg as StoreEffectConfig)?.setUnmodifiedStatus ?? false,
+        (arg as StoreEffectConfig)?.setUnmodifiedStatus ?? true,
     },
   };
killedBy: isModified should mark the store as modified after an effect is processed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
