[Timeout] BlockStatement
signalstory/src/lib/store-event.ts:16:25
  */
 export function createEvent<TPayload = never>(
   name: string
-): StoreEvent<TPayload> {
-  return { name };
-}
+): StoreEvent<TPayload> {}
 

[Timeout] ObjectLiteral
signalstory/src/lib/store-event.ts:17:10
 export function createEvent<TPayload = never>(
   name: string
 ): StoreEvent<TPayload> {
-  return { name };
+  return {};
 }
 
