[Killed] BlockStatement
src/lib/store-immutability/immutable-utility.ts:9:63
  * @param state - The state object to be cloned.
  * @returns A deep clone of the provided state object.
  */
-export function naiveDeepClone<TState>(state: TState): TState {
-  return JSON.parse(JSON.stringify(state)) as TState;
-}
+export function naiveDeepClone<TState>(state: TState): TState {}
 
 /**
killedBy: DeepFreeze plugin should deep freeze after mutate
statusReason: TypeError: Cannot set properties of undefined (setting 'pString')

[Killed] ArrowFunction
src/lib/store-immutability/immutable-utility.ts:22:26
  * @param {T} value - The value object to be cloned.
  * @returns {T} A deep clone of the provided value object.
  */
-export const deepClone = <TState>(state: TState) =>
-  window && 'structuredClone' in window
-    ? structuredClone(state)
-    : naiveDeepClone(state);
+export const deepClone = () => undefined;
 
 /**
killedBy: naiveCloneAndMutate should apply a mutation to a cloned state
statusReason: TypeError: Cannot set properties of undefined (setting 'a')

[Killed] LogicalOperator
src/lib/store-immutability/immutable-utility.ts:23:3
  * @returns {T} A deep clone of the provided value object.
  */
 export const deepClone = <TState>(state: TState) =>
-  window && 'structuredClone' in window
+  window || 'structuredClone' in window
     ? structuredClone(state)
     : naiveDeepClone(state);
killedBy: DeepFreeze plugin should deep freeze after mutate
statusReason: ReferenceError: structuredClone is not defined

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:23:3
  * @returns {T} A deep clone of the provided value object.
  */
 export const deepClone = <TState>(state: TState) =>
-  window && 'structuredClone' in window
+  true
     ? structuredClone(state)
     : naiveDeepClone(state);
killedBy: DeepFreeze plugin should deep freeze after mutate
statusReason: ReferenceError: structuredClone is not defined

[Killed] BlockStatement
src/lib/store-immutability/immutable-utility.ts:32:61
  * @param state - The state to be cloned.
  * @returns Shallow cloned state.
  */
-export function shallowClone<TState>(state: TState): TState {
-  if (!state || typeof state !== 'object') {
-    return state;
-  }
-
-  if (Array.isArray(state)) return [...state] as TState;
-  if (state instanceof Date) return new Date(state) as TState;
-  if (state instanceof RegExp) return new RegExp(state) as TState;
-  if (state instanceof Set) return new Set(state) as TState;
-  if (state instanceof Map) return new Map(state) as TState;
-
-  return Object.assign({}, state) as TState;
-}
+export function shallowClone<TState>(state: TState): TState {}
 
 /**
killedBy: StorePlugin CommandPreprocessor should preprocess command on mutate successfully
statusReason: TypeError: Cannot set properties of undefined (setting 'value')

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:33:17
  * @returns Shallow cloned state.
  */
 export function shallowClone<TState>(state: TState): TState {
-  if (!state || typeof state !== 'object') {
+  if (!state || false) {
     return state;
   }
killedBy: shallowClone should handle regular primitives and strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: {}

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:33:7
  * @returns Shallow cloned state.
  */
 export function shallowClone<TState>(state: TState): TState {
-  if (!state || typeof state !== 'object') {
+  if (true) {
     return state;
   }
killedBy: mutate should update store with the provided mutation function and trigger changed event notification
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not {"value": 10}

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:37:7
     return state;
   }
 
-  if (Array.isArray(state)) return [...state] as TState;
+  if (true) return [...state] as TState;
   if (state instanceof Date) return new Date(state) as TState;
   if (state instanceof RegExp) return new RegExp(state) as TState;
killedBy: shallowClone should shallow clone { name: 'Empty object', original: {} }
statusReason: TypeError: state is not iterable

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:37:7
     return state;
   }
 
-  if (Array.isArray(state)) return [...state] as TState;
+  if (false) return [...state] as TState;
   if (state instanceof Date) return new Date(state) as TState;
   if (state instanceof RegExp) return new RegExp(state) as TState;
killedBy: shallowClone should shallow clone { name: 'Empty array', original: [] }
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: {}

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:38:7
   }
 
   if (Array.isArray(state)) return [...state] as TState;
-  if (state instanceof Date) return new Date(state) as TState;
+  if (true) return new Date(state) as TState;
   if (state instanceof RegExp) return new RegExp(state) as TState;
   if (state instanceof Set) return new Set(state) as TState;
killedBy: shallowClone should shallow clone { name: 'Empty object', original: {} }
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: Date { NaN }

[Survived] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:38:7
   }
 
   if (Array.isArray(state)) return [...state] as TState;
-  if (state instanceof Date) return new Date(state) as TState;
+  if (false) return new Date(state) as TState;
   if (state instanceof RegExp) return new RegExp(state) as TState;
   if (state instanceof Set) return new Set(state) as TState;

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:39:7
 
   if (Array.isArray(state)) return [...state] as TState;
   if (state instanceof Date) return new Date(state) as TState;
-  if (state instanceof RegExp) return new RegExp(state) as TState;
+  if (true) return new RegExp(state) as TState;
   if (state instanceof Set) return new Set(state) as TState;
   if (state instanceof Map) return new Map(state) as TState;
killedBy: shallowClone should shallow clone { name: 'Empty object', original: {} }
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: /[object Object]/

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:39:7
 
   if (Array.isArray(state)) return [...state] as TState;
   if (state instanceof Date) return new Date(state) as TState;
-  if (state instanceof RegExp) return new RegExp(state) as TState;
+  if (false) return new RegExp(state) as TState;
   if (state instanceof Set) return new Set(state) as TState;
   if (state instanceof Map) return new Map(state) as TState;
killedBy: shallowClone should shallow clone { name: 'RegExp object', original: /pattern/ }
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: /pattern/
Received: {}

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:40:7
   if (Array.isArray(state)) return [...state] as TState;
   if (state instanceof Date) return new Date(state) as TState;
   if (state instanceof RegExp) return new RegExp(state) as TState;
-  if (state instanceof Set) return new Set(state) as TState;
+  if (true) return new Set(state) as TState;
   if (state instanceof Map) return new Map(state) as TState;
 
killedBy: shallowClone should shallow clone { name: 'Empty object', original: {} }
statusReason: TypeError: object is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:40:7
   if (Array.isArray(state)) return [...state] as TState;
   if (state instanceof Date) return new Date(state) as TState;
   if (state instanceof RegExp) return new RegExp(state) as TState;
-  if (state instanceof Set) return new Set(state) as TState;
+  if (false) return new Set(state) as TState;
   if (state instanceof Map) return new Map(state) as TState;
 
killedBy: shallowClone should shallow clone { name: 'Set object', original: [Set] }
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: Set {1, 2, 3}
Received: {}

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:41:7
   if (state instanceof Date) return new Date(state) as TState;
   if (state instanceof RegExp) return new RegExp(state) as TState;
   if (state instanceof Set) return new Set(state) as TState;
-  if (state instanceof Map) return new Map(state) as TState;
+  if (false) return new Map(state) as TState;
 
   return Object.assign({}, state) as TState;
killedBy: shallowClone should shallow clone { name: 'Map object', original: [Map] }
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: Map {"key1" => "value1", "key2" => "value2"}
Received: {}

[Killed] ConditionalExpression
src/lib/store-immutability/immutable-utility.ts:41:7
   if (state instanceof Date) return new Date(state) as TState;
   if (state instanceof RegExp) return new RegExp(state) as TState;
   if (state instanceof Set) return new Set(state) as TState;
-  if (state instanceof Map) return new Map(state) as TState;
+  if (true) return new Map(state) as TState;
 
   return Object.assign({}, state) as TState;
killedBy: shallowClone should shallow clone { name: 'Empty object', original: {} }
statusReason: TypeError: object is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/lib/store-immutability/immutable-utility.ts:61:11
 export function naiveCloneAndMutateFunc<TState>(
   currentState: TState,
   mutation: (draftState: TState) => void
-): TState {
-  const clone = deepClone(currentState) as TState;
-  mutation(clone);
-  return clone;
-}
+): TState {}
 
killedBy: DeepFreeze plugin should not notify changes after deep freeze
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "object:4"
Received: "undefined:4"
