[Killed] BlockStatement
src/lib/store-plugin-history/history.ts:22:36
  */
 function isHistoryUndoItem<TState>(
   item: HistoryItem<TState> | undefined
-): item is HistoryUndoItem<TState> {
-  return !!item && 'undoneCommandIndex' in item;
-}
+): item is HistoryUndoItem<TState> {}
 
 /**
killedBy: undo should undo the last two commands when called twice
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 33,

[Killed] BooleanLiteral
src/lib/store-plugin-history/history.ts:23:11
 function isHistoryUndoItem<TState>(
   item: HistoryItem<TState> | undefined
 ): item is HistoryUndoItem<TState> {
-  return !!item && 'undoneCommandIndex' in item;
+  return !item && 'undoneCommandIndex' in item;
 }
 
killedBy: undo should undo the last two commands when called twice
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 33,

[Killed] BlockStatement
src/lib/store-plugin-history/history.ts:39:36
  */
 function isHistoryRedoItem<TState>(
   item: HistoryItem<TState> | undefined
-): item is HistoryRedoItem<TState> {
-  return !!item && 'redoneCommandIndex' in item;
-}
+): item is HistoryRedoItem<TState> {}
 
 /**
killedBy: redo should redo the last two undone commands when called twice
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 33,
+   "value": 22,

[Killed] LogicalOperator
src/lib/store-plugin-history/history.ts:40:10
 function isHistoryRedoItem<TState>(
   item: HistoryItem<TState> | undefined
 ): item is HistoryRedoItem<TState> {
-  return !!item && 'redoneCommandIndex' in item;
+  return !!item || 'redoneCommandIndex' in item;
 }
 
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] ConditionalExpression
src/lib/store-plugin-history/history.ts:40:10
 function isHistoryRedoItem<TState>(
   item: HistoryItem<TState> | undefined
 ): item is HistoryRedoItem<TState> {
-  return !!item && 'redoneCommandIndex' in item;
+  return true;
 }
 
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] BlockStatement
src/lib/store-plugin-history/history.ts:71:9
   history: History<TState>,
   command: string,
   before: TState
-): void {
-  if (command !== UndoCommand && command !== RedoCommand) {
-    history.push({ command, before });
-  }
-}
+): void {}
 
 /**
killedBy: addToHistory with mutable store should clone and add an item to history if history is enabled
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   Object {
-     "before": Object {

[Killed] ConditionalExpression
src/lib/store-plugin-history/history.ts:72:7
   command: string,
   before: TState
 ): void {
-  if (command !== UndoCommand && command !== RedoCommand) {
+  if (true && command !== RedoCommand) {
     history.push({ command, before });
   }
killedBy: addToHistory with mutable store should not add undo or redo commands to history
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"before": {"value": 10}, "command": "_UNDO_"}]

[Killed] ConditionalExpression
src/lib/store-plugin-history/history.ts:72:7
   command: string,
   before: TState
 ): void {
-  if (command !== UndoCommand && command !== RedoCommand) {
+  if (true) {
     history.push({ command, before });
   }
killedBy: addToHistory with mutable store should not add undo or redo commands to history
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 2
Received array:  [{"before": {"value": 10}, "command": "_UNDO_"}, {"before": {"value": 10}, "command": "_REDO_"}]

[Killed] ObjectLiteral
src/lib/store-plugin-history/history.ts:73:18
   before: TState
 ): void {
   if (command !== UndoCommand && command !== RedoCommand) {
-    history.push({ command, before });
+    history.push({});
   }
 }
killedBy: addToHistory with mutable store should clone and add an item to history if history is enabled
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Array [
-   Object {
-     "before": Object {

[Killed] BlockStatement
src/lib/store-plugin-history/history.ts:84:36
  */
 function getLastCommand<TState>(
   history: History<TState>
-): HistoryItem<TState> | undefined {
-  return history.length > 0 ? history[history.length - 1] : undefined;
-}
+): HistoryItem<TState> | undefined {}
 
 /**
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] ConditionalExpression
src/lib/store-plugin-history/history.ts:85:10
 function getLastCommand<TState>(
   history: History<TState>
 ): HistoryItem<TState> | undefined {
-  return history.length > 0 ? history[history.length - 1] : undefined;
+  return false ? history[history.length - 1] : undefined;
 }
 
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] EqualityOperator
src/lib/store-plugin-history/history.ts:85:10
 function getLastCommand<TState>(
   history: History<TState>
 ): HistoryItem<TState> | undefined {
-  return history.length > 0 ? history[history.length - 1] : undefined;
+  return history.length <= 0 ? history[history.length - 1] : undefined;
 }
 
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] ConditionalExpression
src/lib/store-plugin-history/history.ts:97:7
   currentState: TState
 ): { newState: TState; command: string } | null {
   const lastCommand = getLastCommand(history);
-  if (lastCommand) {
+  if (false) {
     // Calculate the index of the command to be undone
     const isUndoItem = isHistoryUndoItem(lastCommand);
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] BlockStatement
src/lib/store-plugin-history/history.ts:97:20
   currentState: TState
 ): { newState: TState; command: string } | null {
   const lastCommand = getLastCommand(history);
-  if (lastCommand) {
-    // Calculate the index of the command to be undone
-    const isUndoItem = isHistoryUndoItem(lastCommand);
-    const toBeUndoneCommandIndex = isUndoItem
-      ? lastCommand.undoneCommandIndex - 1
-      : history.length - 1;
-
-    if (toBeUndoneCommandIndex >= 0) {
-      const toBeUndoneCommand = history[toBeUndoneCommandIndex];
-
-      history.push({
-        command: UndoCommand,
-        before: currentState,
-        undoneCommandIndex: toBeUndoneCommandIndex,
-      });
-
-      return {
-        newState: isUndoItem ? toBeUndoneCommand.before : lastCommand.before,
-        command: UndoCommand,
-      };
-    }
-  }
+  if (lastCommand) {}
 
   return null;
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] ArithmeticOperator
src/lib/store-plugin-history/history.ts:101:9
     // Calculate the index of the command to be undone
     const isUndoItem = isHistoryUndoItem(lastCommand);
     const toBeUndoneCommandIndex = isUndoItem
-      ? lastCommand.undoneCommandIndex - 1
+      ? lastCommand.undoneCommandIndex + 1
       : history.length - 1;
 
killedBy: undo should undo the last two commands when called twice
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 33,

[Killed] ArithmeticOperator
src/lib/store-plugin-history/history.ts:102:9
     const isUndoItem = isHistoryUndoItem(lastCommand);
     const toBeUndoneCommandIndex = isUndoItem
       ? lastCommand.undoneCommandIndex - 1
-      : history.length - 1;
+      : history.length + 1;
 
     if (toBeUndoneCommandIndex >= 0) {
killedBy: undo should undo the last two commands when called twice
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 33,

[Killed] ConditionalExpression
src/lib/store-plugin-history/history.ts:104:9
       ? lastCommand.undoneCommandIndex - 1
       : history.length - 1;
 
-    if (toBeUndoneCommandIndex >= 0) {
+    if (false) {
       const toBeUndoneCommand = history[toBeUndoneCommandIndex];
 
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] BlockStatement
src/lib/store-plugin-history/history.ts:104:38
       ? lastCommand.undoneCommandIndex - 1
       : history.length - 1;
 
-    if (toBeUndoneCommandIndex >= 0) {
-      const toBeUndoneCommand = history[toBeUndoneCommandIndex];
-
-      history.push({
-        command: UndoCommand,
-        before: currentState,
-        undoneCommandIndex: toBeUndoneCommandIndex,
-      });
-
-      return {
-        newState: isUndoItem ? toBeUndoneCommand.before : lastCommand.before,
-        command: UndoCommand,
-      };
-    }
+    if (toBeUndoneCommandIndex >= 0) {}
   }
 
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 10,
+   "value": 22,

[Killed] ObjectLiteral
src/lib/store-plugin-history/history.ts:113:14
         undoneCommandIndex: toBeUndoneCommandIndex,
       });
 
-      return {
-        newState: isUndoItem ? toBeUndoneCommand.before : lastCommand.before,
-        command: UndoCommand,
-      };
+      return {};
     }
   }
killedBy: undo should undo the last command and revert to inital state
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"value": 10}
Received: undefined

[Killed] BlockStatement
src/lib/store-plugin-history/history.ts:132:20
   currentState: TState
 ): { newState: TState; command: string } | null {
   const lastCommand = getLastCommand(history);
-  if (lastCommand) {
-    // Calculate the index of the command to be redone
-    const toBeRedoneCommandIndex = isHistoryRedoItem(lastCommand)
-      ? lastCommand.redoneCommandIndex - 1
-      : history.length - 1;
-
-    if (toBeRedoneCommandIndex >= 0) {
-      const toBeRedoneCommand = history[toBeRedoneCommandIndex];
-      if (isHistoryUndoItem(toBeRedoneCommand)) {
-        // Redo is only possible for Undo commands
-        history.push({
-          command: RedoCommand,
-          before: currentState,
-          redoneCommandIndex: toBeRedoneCommandIndex,
-        });
-
-        return {
-          newState: toBeRedoneCommand.before,
-          command: RedoCommand,
-        };
-      }
-    }
-  }
+  if (lastCommand) {}
 
   return null;
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] ArithmeticOperator
src/lib/store-plugin-history/history.ts:135:9
   if (lastCommand) {
     // Calculate the index of the command to be redone
     const toBeRedoneCommandIndex = isHistoryRedoItem(lastCommand)
-      ? lastCommand.redoneCommandIndex - 1
+      ? lastCommand.redoneCommandIndex + 1
       : history.length - 1;
 
killedBy: redo should redo the last two undone commands when called twice
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 33,
+   "value": 22,

[Killed] ArithmeticOperator
src/lib/store-plugin-history/history.ts:136:9
     // Calculate the index of the command to be redone
     const toBeRedoneCommandIndex = isHistoryRedoItem(lastCommand)
       ? lastCommand.redoneCommandIndex - 1
-      : history.length - 1;
+      : history.length + 1;
 
     if (toBeRedoneCommandIndex >= 0) {
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] EqualityOperator
src/lib/store-plugin-history/history.ts:138:9
       ? lastCommand.redoneCommandIndex - 1
       : history.length - 1;
 
-    if (toBeRedoneCommandIndex >= 0) {
+    if (toBeRedoneCommandIndex < 0) {
       const toBeRedoneCommand = history[toBeRedoneCommandIndex];
       if (isHistoryUndoItem(toBeRedoneCommand)) {
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] ConditionalExpression
src/lib/store-plugin-history/history.ts:138:9
       ? lastCommand.redoneCommandIndex - 1
       : history.length - 1;
 
-    if (toBeRedoneCommandIndex >= 0) {
+    if (false) {
       const toBeRedoneCommand = history[toBeRedoneCommandIndex];
       if (isHistoryUndoItem(toBeRedoneCommand)) {
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] ConditionalExpression
src/lib/store-plugin-history/history.ts:140:11
 
     if (toBeRedoneCommandIndex >= 0) {
       const toBeRedoneCommand = history[toBeRedoneCommandIndex];
-      if (isHistoryUndoItem(toBeRedoneCommand)) {
+      if (true) {
         // Redo is only possible for Undo commands
         history.push({
killedBy: redo should do nothing if the last command was not an undo command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,

[Killed] ConditionalExpression
src/lib/store-plugin-history/history.ts:140:11
 
     if (toBeRedoneCommandIndex >= 0) {
       const toBeRedoneCommand = history[toBeRedoneCommandIndex];
-      if (isHistoryUndoItem(toBeRedoneCommand)) {
+      if (false) {
         // Redo is only possible for Undo commands
         history.push({
killedBy: redo should redo the last undone command
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 22,
+   "value": 10,
