[Killed] BlockStatement
src/lib/store-plugin-deep-freeze/plugin-deep-freeze.ts:10:46
  *
  * @returns DeepFreeze Storeplugin.
  */
-export function useDeepFreeze(): StorePlugin {
-  return {
-    postprocessCommand(store) {
-      deepFreeze(store.state());
-    },
-  };
-}
+export function useDeepFreeze(): StorePlugin {}
 
killedBy: DeepFreeze plugin should deep freeze after set without creating new object
statusReason: TypeError: Cannot read properties of undefined (reading 'init')

[Killed] BlockStatement
src/lib/store-plugin-deep-freeze/plugin-deep-freeze.ts:12:31
  */
 export function useDeepFreeze(): StorePlugin {
   return {
-    postprocessCommand(store) {
-      deepFreeze(store.state());
-    },
+    postprocessCommand(store) {},
   };
 }
killedBy: DeepFreeze plugin should deep freeze after set without creating new object
statusReason: Error: expect(received).toBeTruthy()

Received: false
