[Killed] BlockStatement
src/lib/store-plugin-persistence/persistence.ts:20:23
 export function loadFromStorage<TState>(
   persistenceStorage: PersistenceStorage,
   persistenceKey: string
-): TState | undefined {
-  const value = persistenceStorage.getItem(persistenceKey);
-
-  try {
-    return value ? (JSON.parse(value) as TState) : undefined;
-  } catch {
-    return undefined;
-  }
-}
+): TState | undefined {}
 
 /**
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"val": "initial"}
Received: undefined

[Killed] BlockStatement
src/lib/store-plugin-persistence/persistence.ts:23:7
 ): TState | undefined {
   const value = persistenceStorage.getItem(persistenceKey);
 
-  try {
-    return value ? (JSON.parse(value) as TState) : undefined;
-  } catch {
+  try {} catch {
     return undefined;
   }
killedBy: loadFromStorage should load the stored value from persistence storage
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"val": "initial"}
Received: undefined

[Survived] BlockStatement
src/lib/store-plugin-persistence/persistence.ts:25:11
 
   try {
     return value ? (JSON.parse(value) as TState) : undefined;
-  } catch {
-    return undefined;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/lib/store-plugin-persistence/persistence.ts:41:9
   persistenceStorage: PersistenceStorage,
   persistenceKey: string,
   value: TState
-): void {
-  persistenceStorage.setItem(persistenceKey, JSON.stringify(value));
-}
+): void {}
 
 /**
killedBy: saveToStorage should save the store state to persistence storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myStoreKey", "{\"val\":\"initial\"}"

Number of calls: 0

[Killed] BlockStatement
src/lib/store-plugin-persistence/persistence.ts:54:9
 export function clearStorage(
   persistenceStorage: PersistenceStorage,
   persistenceKey: string
-): void {
-  persistenceStorage.removeItem(persistenceKey);
-}
+): void {}
 
killedBy: clearStorage should remove the stored value from persistence storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "myStoreKey"

Number of calls: 0
