[Killed] BlockStatement
signalstory/src/lib/store-query.ts:115:46
 export function createQuery<TResult>(
   stores: ProviderToken<any>[],
   query: (...stores: any[]) => TResult
-): StoreQuery<TResult, ProviderToken<any>[]> {
-  return {
-    stores: stores,
-    query: query,
-  };
-}
+): StoreQuery<TResult, ProviderToken<any>[]> {}
 
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: TypeError: Cannot read properties of undefined (reading 'stores')

[Killed] ObjectLiteral
signalstory/src/lib/store-query.ts:116:10
   stores: ProviderToken<any>[],
   query: (...stores: any[]) => TResult
 ): StoreQuery<TResult, ProviderToken<any>[]> {
-  return {
-    stores: stores,
-    query: query,
-  };
+  return {};
 }
 
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: TypeError: Cannot read properties of undefined (reading 'map')
