[Killed] BlockStatement
src/lib/utility/injector-helper.ts:12:54
  *
  * @returns The Angular injector if available, otherwise null.
  */
-export function getInjectorOrNull(): Injector | null {
-  try {
-    return inject(Injector);
-  } catch (_) {
-    return null;
-  }
-}
+export function getInjectorOrNull(): Injector | null {}
 
killedBy: runEffect should runEffect in injection context by default
statusReason: Error: NG0203: inject() must be called from an injection context such as a constructor, a factory function, a field initializer, or a function used with `runInInjectionContext`. Find more at https://angular.io/errors/NG0203

[Killed] BlockStatement
src/lib/utility/injector-helper.ts:13:7
  * @returns The Angular injector if available, otherwise null.
  */
 export function getInjectorOrNull(): Injector | null {
-  try {
-    return inject(Injector);
-  } catch (_) {
+  try {} catch (_) {
     return null;
   }
killedBy: runQuery targeting single store without parameters should return correct computed signal
statusReason: Error: NG0203: runQuery() can only be used within an injection context such as a constructor, a factory function, a field initializer, or a function used with `runInInjectionContext`. Find more at https://angular.io/errors/NG0203

[Survived] BlockStatement
src/lib/utility/injector-helper.ts:15:15
 export function getInjectorOrNull(): Injector | null {
   try {
     return inject(Injector);
-  } catch (_) {
-    return null;
-  }
+  } catch (_) {}
 }
 
