[Killed] BlockStatement
src/lib/utility/sideeffect.ts:20:71
  * @returns True if the object is a promise, false otherwise.
  * @template T - The type of the resolved value of the promise.
  */
-function isPromise<T>(obj: T | PromiseLike<T>): obj is PromiseLike<T> {
-  return (
-    obj &&
-    typeof (obj as PromiseLike<T>).then === 'function' &&
-    typeof (obj as PromiseLike<T>).finally === 'function'
-  );
-}
+function isPromise<T>(obj: T | PromiseLike<T>): obj is PromiseLike<T> {}
 
 /**
killedBy: StorePlugin EffectPostprocessor should postprocess effect with resolved promise successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] ConditionalExpression
src/lib/utility/sideeffect.ts:22:5
  */
 function isPromise<T>(obj: T | PromiseLike<T>): obj is PromiseLike<T> {
   return (
-    obj &&
-    typeof (obj as PromiseLike<T>).then === 'function' &&
-    typeof (obj as PromiseLike<T>).finally === 'function'
+    true
   );
 }
killedBy: StorePlugin EffectPostprocessor should postprocess normal effect successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'finally')

[Killed] ConditionalExpression
src/lib/utility/sideeffect.ts:22:5
  */
 function isPromise<T>(obj: T | PromiseLike<T>): obj is PromiseLike<T> {
   return (
-    obj &&
-    typeof (obj as PromiseLike<T>).then === 'function' &&
+    true &&
     typeof (obj as PromiseLike<T>).finally === 'function'
   );
killedBy: StorePlugin EffectPostprocessor should postprocess normal effect successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'finally')

[Killed] EqualityOperator
src/lib/utility/sideeffect.ts:23:5
 function isPromise<T>(obj: T | PromiseLike<T>): obj is PromiseLike<T> {
   return (
     obj &&
-    typeof (obj as PromiseLike<T>).then === 'function' &&
+    typeof (obj as PromiseLike<T>).then !== 'function' &&
     typeof (obj as PromiseLike<T>).finally === 'function'
   );
killedBy: StorePlugin EffectPostprocessor should postprocess effect with resolved promise successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Survived] ConditionalExpression
src/lib/utility/sideeffect.ts:23:5
 function isPromise<T>(obj: T | PromiseLike<T>): obj is PromiseLike<T> {
   return (
     obj &&
-    typeof (obj as PromiseLike<T>).then === 'function' &&
+    true &&
     typeof (obj as PromiseLike<T>).finally === 'function'
   );

[Killed] EqualityOperator
src/lib/utility/sideeffect.ts:24:5
   return (
     obj &&
     typeof (obj as PromiseLike<T>).then === 'function' &&
-    typeof (obj as PromiseLike<T>).finally === 'function'
+    typeof (obj as PromiseLike<T>).finally !== 'function'
   );
 }
killedBy: StorePlugin EffectPostprocessor should postprocess effect with resolved promise successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Survived] ConditionalExpression
src/lib/utility/sideeffect.ts:24:5
   return (
     obj &&
     typeof (obj as PromiseLike<T>).then === 'function' &&
-    typeof (obj as PromiseLike<T>).finally === 'function'
+    true
   );
 }

[Killed] BlockStatement
src/lib/utility/sideeffect.ts:35:73
  * @returns The source object with the side effect applied.
  * @template T - The type of the source object.
  */
-export function withSideEffect<T>(source: T, sideEffect: () => void): T {
-  if (isObservable(source)) {
-    return source.pipe(finalize(sideEffect)) as T;
-  } else if (isPromise(source)) {
-    return source.finally(sideEffect) as T;
-  }
-
-  sideEffect();
-  return source;
-}
+export function withSideEffect<T>(source: T, sideEffect: () => void): T {}
 
killedBy: StorePlugin EffectPostprocessor should postprocess normal effect successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] ConditionalExpression
src/lib/utility/sideeffect.ts:36:7
  * @template T - The type of the source object.
  */
 export function withSideEffect<T>(source: T, sideEffect: () => void): T {
-  if (isObservable(source)) {
+  if (false) {
     return source.pipe(finalize(sideEffect)) as T;
   } else if (isPromise(source)) {
killedBy: StorePlugin EffectPostprocessor should postprocess observable effect successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] BlockStatement
src/lib/utility/sideeffect.ts:36:29
  * @template T - The type of the source object.
  */
 export function withSideEffect<T>(source: T, sideEffect: () => void): T {
-  if (isObservable(source)) {
-    return source.pipe(finalize(sideEffect)) as T;
-  } else if (isPromise(source)) {
+  if (isObservable(source)) {} else if (isPromise(source)) {
     return source.finally(sideEffect) as T;
   }
killedBy: StorePlugin EffectPostprocessor should postprocess observable effect successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] ConditionalExpression
src/lib/utility/sideeffect.ts:38:14
 export function withSideEffect<T>(source: T, sideEffect: () => void): T {
   if (isObservable(source)) {
     return source.pipe(finalize(sideEffect)) as T;
-  } else if (isPromise(source)) {
+  } else if (false) {
     return source.finally(sideEffect) as T;
   }
killedBy: StorePlugin EffectPostprocessor should postprocess effect with resolved promise successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] BlockStatement
src/lib/utility/sideeffect.ts:38:33
 export function withSideEffect<T>(source: T, sideEffect: () => void): T {
   if (isObservable(source)) {
     return source.pipe(finalize(sideEffect)) as T;
-  } else if (isPromise(source)) {
-    return source.finally(sideEffect) as T;
-  }
+  } else if (isPromise(source)) {}
 
   sideEffect();
killedBy: StorePlugin EffectPostprocessor should postprocess effect with resolved promise successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10
